{
  "code": "BSB50120",
  "name": "Diploma of Business",
  "level": "Diploma",
  "units": [
    {
      "code": "BSBCRT511",
      "name": "Develop critical thinking in others",
      "description": "Application:\nThis unit describes the skills and knowledge required to develop critical and creative thinking skills in others within a workplace context.\nThe unit applies to individuals who are developing and coaching others, for whom critical thinking skills (including analysis, synthesis, and evaluation) are an important part of their job roles. This unit applies to individuals who are typically responsible for leading teams.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Assess individual and team critical and creative thinking skills: 1.1 Research models of critical and creative thinking\n1.2 Develop questions to identify individual and team knowledge gaps\n1.3 Facilitate formal and informal learning opportunities for addressing identified gaps\n1.4 Articulate key features of critical and creative thinking concepts to relevant personnel\n2. Establish an environment that encourages the application of critical and creative thinking: 2.1 Analyse current organisational systems to identify gaps or barriers to critical thinking \n2.2 Develop processes that create a safe environment for critical and creative thinking approaches\n2.3 Facilitate opportunities for team members to apply critical thinking skills to workplace problems\n2.4 Provide feedback to team members on performance of tasks\n3. Monitor and improve thinking practices: 3.1 Collect and analyse feedback from individuals and teams on critical and creative thinking opportunities \n3.2 Identify additional support required for teams and individuals\n3.3 Develop recommendations for improvements in future learning arrangements according to relevant legislation and organisation policies\nSkill: Description\nLearning: Transfers skills and knowledge to a variety of team development contexts\nEvaluates own performance and outcomes of learning processes to identify opportunities for improvement\nOral communication: Identifies and articulates ideas and requirements clearly and persuasively using techniques appropriate to audience and environment\nParticipates in a verbal exchange of ideas and elicits the views and opinions of others by listening and questioning\nReading: Researches, analyses and evaluates textual information, from a wide range of sources, to identify information relevant to systems that support critical thinking and learning\nWriting: Develops complex strategies using language and format appropriate to the audience and purpose\nTeamwork: Looks for ways of establishing connections and building genuine understanding with a diverse range of people\nUses inclusive and collaborative techniques to negotiate, influence and elicit the views and opinions of a wide range of stakeholders\nInitiative and enterprise: Identifies implications of legal and regulatory responsibilities on own work\nPlanning and organising: Accepts responsibility for planning and implementing systems and strategies to achieve organisational goals, negotiating key aspects with others\nAdheres to implicit and explicit organisational policies and procedures, seeking advice from others if necessary\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "develop an environment for an organisation or work area that supports the application of critical and creative thinking methods.",
        "In the course of the above, the candidate must:",
        "identify critical and creative thinking concepts and approaches, and their application to a workplace context",
        "facilitate relevant learning opportunities for others",
        "develop questions and prompt questioning to broaden knowledge and understanding of the team member cohort",
        "monitor team skill development to develop recommendations on future learning arrangements to be implemented in future planning."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\nmodels of critical and creative thinking\nfeatures of critical thinking concepts and approaches including analysis, synthesis, and evaluation\nexisting workplace objectives, processes and resources\ncharacteristics of organisational learning environments and related learning systems\nlegislative requirements relating to workplace procedures\nsources of reliable information relevant to workplace procedures\nfeatures of industry best practice approach to instruction on critical and creative thinking methods\nleading a team and individuals to develop critical and creative thinking skills.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBFIN501",
      "name": "Manage budgets and financial plans",
      "description": "Application:\nThis unit describes the skills and knowledge required to undertake financial management in an organisation or work area. It includes planning and implementing financial management approaches and supporting and evaluating effectiveness of financial management processes.\nThe unit applies to managers in a wide range of organisations and sectors who have responsibility for the effective use of financial resources within work teams. They are responsible for ensuring that financial resources are managed in line with the financial objectives of the team and organisation.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Plan financial management approaches: 1.1 Access budget and financial plans for work team \n1.2 Evaluate budget and financial plan outcomes with required organisational personnel \n1.3 Negotiate any changes required to be made to budget and financial plans with required organisational personnel\n1.4 Prepare contingency plans in the event that initial plans need to be varied\n2. Implement and monitor financial management plans: 2.1 Communicate details of agreed budget and financial plans to relevant team members\n2.2 Support team members to access resources and systems to perform required roles \n2.3 Implement processes to monitor actual expenditure, control costs and modify contingency plans as required according to financial objectives \n2.4 Report on budget and expenditure according to organisational protocols\n3. Review and evaluate financial management plans: 3.1 Collect information on effectiveness of financial management processes within work team\n3.2 Analyse variance between actual and budgeted finances\n3.3 Identify and recommend improvements to existing financial management processes \n3.4 Implement agreed improvements according to financial objectives of work team and organisation \n3.5 Evaluate agreed improvements\nSKILL: DESCRIPTION\nNumeracy: Uses a wide range of mathematical calculations to analyse numeric information in budgets or financial plans\nOral communication: Presents information about financial issues and requirements to a range of audiences using structure and language to suit audience \nUses active listening and questioning to clarify information and to confirm understanding\nReading: Interprets and analyses information to determine activities required\nWriting: Records information in correct forms and prepares materials which convey detailed and factual content according to internal procedures\nTeamwork: Uses a range of strategies to connect, collaborate and cooperate with other work colleagues in activities requiring collective effort and diverse skills and knowledge\nInitiative and enterprise: Applies organisational requirements in undertaking own work\nPlanning and organising: Uses logical processes in planning, implementing and evaluating complex tasks and developing alternative strategies to achieve goals and timelines\nTechnology: Uses a range of digital technologies to access, filter, compile, integrate and logically present complex information from multiple sources\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "manage the budget and financial plan of an organisation for one reporting period.",
        "In the course of the above, the candidate must:",
        "communicate with relevant people to clarify budget and financial plans, negotiate changes and disseminate information",
        "prepare, implement and modify financial contingency plans",
        "monitor expenditure and control costs",
        "support and monitor team members",
        "report on budget and expenditure",
        "review and make recommendations for improvements to financial processes",
        "meet record-keeping requirements for Australian Taxation Office (ATO) and for auditing purposes."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\nbasic accounting principles\ntypes of budgets and financial plans\nlegislation and current ATO requirements, including the Goods and Services Tax (GST)\nkey requirements for financial record keeping and auditing\nprinciples for managing work teams\nprinciples and techniques involved in managing:\nbudgeting\ncash flows\nelectronic spreadsheets\nGoods and Services Tax\nledgers and financial statements\nprofit and loss statements\nevaluation of budget and financial plans.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBFIN502",
      "name": "Manage financial compliance",
      "description": "Application:\nThis unit describes the skills and knowledge required to manage financial compliance in an organisation or work area. It includes planning financial management processes, implementing necessary change and monitoring effectiveness of the performance of changes implemented.\nThe unit applies to managers in a wide range of organisations and sectors who have responsibility for ensuring financial compliance within work teams. They support the management of financial resources to ensure that they are managed in line with team, organisation and wider compliance requirements.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Plan for financial compliance: 1.1 Identify financial compliance legislation, regulations, codes of conduct applicable to organisation or work area\n1.2 Analyse and document identified legislation, regulations and codes of conduct according to task requirements\n1.3 Identify priority risks from risk analysis \n1.4 Plan risk mitigation strategies for identified risks \n1.5 Establish indicators to measure financial compliance\n2. Develop and implement strategies for financial compliance: 2.1 Develop strategies to support financial compliance \n2.2 Communicate financial compliance strategy to relevant staff \n2.3 Ensure relevant staff follow financial compliance strategy\n3. Evaluate compliance: 3.1 Monitor financial compliance processes \n3.2 Review and adjust financial compliance procedures\n3.3 Improve financial compliance systems using evaluation data\nSkill: Description\nLearning: Identifies organisational issues and uses formal thinking techniques to develop a range of possible solutions\nNumeracy: Reviews and analyses numerical data embedded in organisational documentation and legislation\nUses appropriate formulae to analyse financial data to assess and manage risk and identify discrepancies\nOral communication: Presents an explanation of workplace procedures to a group, adapting, reiterating, summarising and clarifying information as required\nReading: Analyses and evaluates complex information to determine and adhere to organisational or legislative requirements and to assist with financial decision making\nWriting: Prepares documents using format, content and layout appropriate to audience, purpose and regulatory requirements\nPlanning and organising: Uses formal analytical thinking techniques to identify issues, investigate underlying causes and generate possible solutions, seeking input from others as required\nTechnology: Uses a range of digital technology to access, filter, compile, integrate and logically present complex information from multiple sources\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "on at least two occasions, plan, develop, implement and evaluate financial compliance strategies.",
        "In the course of the above, the candidate must:",
        "identify financial compliance risks in the workplace",
        "interpret and analyse operational and feedback data relating to compliance",
        "plan and develop risk mitigation strategies for identified compliance risks",
        "incorporate risk controls and risk mitigation strategies in policies, procedures and business strategies."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\nlegislation, regulations, standards and codes of practice for business financial compliance\nmethods and tools for recording, reporting and managing compliance\nprocedures for conducting risk analysis\nrisk mitigation strategies\nindustry best practice and quality standards for financial compliance\ncompliance risk ratings.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBFIN601",
      "name": "Manage organisational finances",
      "description": "Application:\nThis unit describes the skills and knowledge required to undertake budgeting, financial forecasting and reporting. This unit also describes the skills and knowledge required to allocate and manage resources to achieve the required outputs for the business unit. It includes contributing to reviewing financial information, analysing financial risks, preparing a budget and reporting on financial activity.\nThe unit applies to individuals who have managerial responsibilities which include overseeing the management of financial and other resources across a business unit, a series of business units or teams, or an organisation. It covers all areas of broad financial management. In a larger organisation this work would be supported by specialists in financial management.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Prepare for financial management: 1.1 Assess reasons for losses or profits identified from previous financial reports \n1.2 Analyse critical dates and initiatives in business plan and cash flow trends\n1.3 Review statutory requirements for compliance and liabilities for tax\n1.4 Analyse existing software and its suitability for financial management\n2. Establish budgets and allocate funds: 2.1 Develop budget from previous financial data according to compliance, organisational and statutory requirements \n2.2 Circulate budgets and confirm managers and supervisors understand budgets, reporting requirements and financial delegations \n2.3 Confirm there are no opportunities for misappropriation of funds \n2.4 Review profit and loss statements, cash flows and ageing summaries and revise, where required \n2.5 Identify discrepancies between agreed and actual allocations using audit trails\n3. Report on finances: 3.1 Identify organisational and statutory financial reporting requirements\n3.2 Identify and prioritise significant issues in statements for review and decision making\n3.3 Prepare financial recommendations \n3.4 Evaluate effectiveness of financial management processes\nSKILL: DESCRIPTION\nNumeracy: Reviews and analyses numerical data embedded in organisational documentation and legislation\nCompares and contrasts complex numerical data to analyse and evaluate financial position and processes\nUses appropriate formulae to analyse financial data to assess and manage risk and identify discrepancies\nOral communication: Explains financial decisions and outcomes clearly and uses listening and questioning techniques to exchange information and obtain agreement\nReading: Analyses and evaluates complex organisational information and legislative requirements to assist with financial decision making\nWriting: Develops and records information which incorporates a detailed analysis of factual and forecasted information\nPrepares documents using format, content and layout appropriate to audience, purpose and regulatory requirements\nTeamwork: Selects and uses appropriate conventions and protocols when communicating with supervisors and managers to share information or seek agreement\nInitiative and enterprise: Identifies and complies with legislative and organisational requirements in undertaking own work\nPlanning and organising: Uses logical processes in planning, implementing and evaluating complex tasks to achieve stated goals\nUses formal analytical thinking techniques to identify issues, investigate underlying causes and generate possible solutions, seeking input from others as required\nTechnology: Uses a range of digital technology to access, filter, compile, integrate and logically present complex information from multiple sources\nInvestigates new digital technologies and applications to manage and manipulate data\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "manage finances for at least one organisation or work area.",
        "In the course of the above, the candidate must:",
        "review previous financial statements",
        "prepare, implement and revise a budget that:",
        "aligns with business plan",
        "is based on research and analysis of previous financial data and cash flow trends",
        "meets compliance, statutory and organisational requirements",
        "contribute to financial bids and estimates",
        "communicate with other people, including:",
        "reporting on financial activity and making recommendations",
        "ensuring managers and supervisors understand key elements of relevant budgets",
        "analyse effectiveness of existing financial management approaches, including:",
        "reviewing financial management software",
        "managing risks of misappropriation of funds",
        "ensuring systems are in place to record all transactions",
        "maintaining audit trail",
        "complying with due diligence."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\nprocesses to establish and review profits and losses from financial statements\nrequirements for financial probity\nprinciples of accounting and financial systems\nkey functions of financial management software\nkey components of a financial budget\nLegislation and conventions relevant to financial management in organisation\nAustralian Tax Office (ATO) requirements for Goods and Services Tax, Company Tax, Pay As You Go (PAYG).",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBHRM525",
      "name": "Manage recruitment and onboarding",
      "description": "Application:\nThis unit describes the skills and knowledge required to manage all aspects of recruitment and onboarding processes according to organisational policies and procedures.\nThe unit applies to individuals who take responsibility for managing aspects of recruiting, selecting new staff and orientating those staff in their new positions. The individual may be directly involved in the recruitment processes themselves or coordinating the process.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Develop recruitment and onboarding policies and procedures: 1.1 Identify existing recruitment and onboarding policies and procedures\n1.2 Assess options for technology to improve efficiency and effectiveness of recruitment process\n1.3 Update existing policies and procedures according to organisational requirements\n1.4 Obtain support for policies and procedures from relevant stakeholders\n1.5 Create forms and documents supporting policies and procedures and make adjustments, where required\n1.6 Communicate policies and procedures to relevant staff and provide training, where required\n2. Manage recruitment process: 2.1 Determine future human resource requirements in collaboration with relevant stakeholders\n2.2 Ensure current position descriptors for vacancies are used by relevant stakeholders involved in recruitment and onboarding processes\n2.3 Ensure advertising of vacant positions complies with legislation and organisational policies and procedures \n2.4 Consult and use specialists, where required\n2.5 Ensure selection procedures are according to legislation and organisational policies and procedures\n2.6 Ensure processes for advising applicants of selection outcome are followed\n2.7 Ensure job offers and contracts of employment are prepared and provided promptly, and new appointments are provided with relevant advice\n3. Manage staff onboarding: 3.1 Provide access to training and support to relevant stakeholders\n3.2 Ensure onboarding processes are followed across the organisation\n3.3 Oversee management of probationary employees and provide feedback until employment is confirmed or terminated\n3.4 Collect feedback from participants and relevant stakeholders on onboarding process according to its objectives\n3.5 Update onboarding policies and procedures according to feedback\nSKILL: DESCRIPTION\nReading: Critically evaluates and applies content from a range of complex texts to determine legislative and business requirements\nWriting: Demonstrates clear writing skills by selecting appropriate conventions and by expressing precise meaning relevant to context and audience\nOral Communication: Draws on a repertoire of open questioning and active listening when seeking feedback from others\nUses appropriate terminology and non-verbal features to present information and clarify understanding\nNumeracy: Analyses numerical information to determine employees’ remuneration packages \nMakes basic calculations to ensure work output is delivered in a timely manner\nInitiative and enterprise: Develops or updates organisational policies to meet organisational objectives\nConsiders own role in terms of its contribution to broader goals of work environment\nAnalyses outcomes of decisions to identify improvement opportunities\nSeeks expert advice and skills training, where required\nTeamwork: Considers whether and how often others should be involved, using consultative or collaborative processes as an integral part of the decision-making process\nPlanning and organising: Plans and implements tasks required to deliver timely outcomes, negotiating some key aspects with others\nMonitors implementation of plans and adjusts as necessary\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "manage the recruitment and onboarding process for two different individuals.",
        "In the course of the above, the candidate must:",
        "update organisational policies and procedures for recruitment and onboarding",
        "identify the need for recruitment",
        "prepare and oversee appropriate documentation required for recruitment",
        "select and advise job applicants appropriately",
        "manage the onboarding process",
        "comply with relevant legislation and organisational requirements."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\nkey features of recruitment, selection and onboarding policies and procedures\ncommon recruitment and selection methods\nrelevant legislation, regulations, standards and codes of practice that may affect recruitment and onboarding\nkey features of psychometric and skills testing programs for recruitment\nkey components of contracts of employment.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBHRM526",
      "name": "Manage payroll",
      "description": "Application:\nThis unit describes the skills and knowledge required to establish and monitor security procedures for managing organisational payroll services and to calculate and process salary payments, group taxation and related payments.\nThe unit applies to individuals, employed in a range of work environments, who are required to establish and work with payroll systems and may have responsibility for managing payroll systems and calculations.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Establish procedures for payroll management: 1.1 Ensure the confidentiality and security of payroll information\n1.2 Ensure procedures guarantee substantiation of claims for allowances \n1.3 Safeguard organisation’s financial resources according to legislative and organisational requirements\n1.4 Establish systems to ensure statutory obligations are met and records are kept for the period determined by government legislation\n2. Prepare payroll data: 2.1 Calculate gross pay and annual salaries \n2.2 Calculate statutory and voluntary deductions using government and employee documentation\n2.3 Provide payroll data to payroll processor for calculation within designated timelines\n3. Authorise payment of salaries: 3.1 Check payroll, and authorise salaries and wages for payment according to organisational policy and procedures\n3.2 Reconcile salaries, wages and deductions according to organisational policy and procedures\n3.3 Handle salary, wage and related enquiries according to organisational policy and procedures\n4. Administer salary records: 4.1 Process declaration forms for new and existing employees according to Australian Taxation Office requirements\n4.2 Forward periodic deductions to nominated creditors within designated timelines\n4.3 Prepare and dispatch payments to government authorities accurately and according to relevant government legislation\n4.4 Calculate and transcribe group tax amounts and make payments according to taxation procedures\n4.5 Prepare and reconcile employee group certificate amounts from salary records\nSKILL: DESCRIPTION\nReading: Identifies and interprets information from organisational policies, legislative and industry-related material\nWriting: Records data accurately using relevant format, style and language suited to context and audience \nPrepares specific information which clearly conveys an understanding of outcomes and uses appropriate terminology to present to relevant stakeholder\nOral Communication: Articulates information concisely using appropriate terminology, tone and style\nUses questioning and listening techniques to exchange and clarify information\nNumeracy: Uses a wide range of mathematical calculations to analyse and compare numerical information\nMakes calculations to ensure work is completed according to predetermined deadlines\nInitiative and enterprise: Recognises and applies the protocols governing what to communicate with who, and how, in a range of work contexts\nSelf-management: Uses logical processes in planning, implementing and evaluating routine and non-routine tasks in achieving goals and timelines\nUnderstands the importance of secure information and privacy in relation to own work and takes responsibility for identifying and managing risk factors\nProblem solving: Uses analytical skills to identify discrepancies and attempts to resolve the issues within the context of own responsibilities \nMakes a range of critical and non-critical decisions in relatively complex situations, taking a range of factors into account\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "on at least one occasion establish procedures for payroll management",
        "on at least two occasions prepare payroll, authorise payment and administer salary records.",
        "In the course of the above, the candidate must:",
        "document steps undertaken to establish payroll system",
        "use data and calculations to reconcile salaries, wages and deductions according to all legislative and organisational requirements",
        "create accurate payroll management records."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\nkey provisions of relevant legislation, standards, regulations and codes of practice that may affect aspects of payroll operations\nkey features of policies and procedures relevant to payroll processes\nkey methods of calculating gross pay and annual salary using nominal awards, contracts and government legislation\nprocesses associated with Single Touch Payroll (STP).",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBHRM529",
      "name": "Coordinate separation and termination processes",
      "description": "Application:\nThis unit describes the skills and knowledge required to coordinate redeployment, resignation, retirement, dismissal and redundancy, including the conduct of exit interviews.\nThe unit applies to individuals who take responsibility for overseeing aspects of managing the voluntary and involuntary termination of employment.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Assist development of policies and procedures: 1.1 Research features of best practice systems of separation and termination and the legal requirements\n1.2 Consult relevant stakeholders prior to introduction of new policies, procedures and supporting documentation\n1.3 Assist in determining policies, procedures and supporting documentation for all forms of separation and termination \n1.4 Ensure procedures for dismissal or termination are according to legislative requirements and organisational policies and procedures\n1.5 Obtain support for separation and termination policies and procedures from relevant stakeholders\n1.6 Communicate policies and procedures, and provide supporting documents to relevant stakeholders \n1.7 Seek and use feedback to refine policies, procedures and supporting documents for separation and termination\n2. Coordinate separation and termination: 2.1 Facilitate the development of a redundancy or redeployment plan\n2.2 Coordinate management of redundancies and redeployment and provide relevant information about processes \n2.3 Provide outplacement or other assistance according to organisational policies and legal requirements\n2.4 Ensure dismissals for incapacity to perform or misconduct comply with legislative requirements and organisational policies and procedures\n2.5 Ensure human resource staff, managers and supervisors have necessary skills and knowledge to take disciplinary action\n2.6 Review workforce data for predicted numbers of people retiring and make necessary plans\n2.7 Review and evaluate separation and termination procedures and suggest improvements\n3. Coordinate exit interview process: 3.1 Provide separating employees opportunity to participate in exit interviews\n3.2 Create clear process for exit interviews and that staff are skilled to conduct them\n3.3 Record and depersonalise data from exit interviews\n3.4 Establish trends and patterns and suggest improvements across the organisation according to data from exit interviews\nSKILL: DESCRIPTION\nLearning: Ensures staff have necessary skills and training to oversee employee terminations\nReading: Critically evaluates and applies content from a range of texts to determine legislative and business requirements\nWriting: Uses a range of writing skills and techniques to create or edit organisational documentation in required format for a range of audiences\nCreates records in required format and structure\nOral Communication: Uses appropriate terminology and non-verbal features when consulting others and presenting information \nUses open questioning and active listening skills when seeking feedback from others\nNumeracy: Undertakes basic mathematical calculations to review and manipulate workforce data\nInitiative and enterprise: Identifies and adheres to legislative and organisational requirements relevant to role\nDevelops or updates policies and procedures to achieve organisational goals \nMonitors adherence to organisational policies and procedures\nTeamwork: Collaborates with others to achieve outcomes, playing an active role in facilitating understanding of procedures\nProblem solving: Plans and implements tasks to achieve outcomes according to legislative and organisational requirements \nUses systematic processes to gather and analyse the data needed to make decisions that affect the organisation \nUses consultation and analytical thinking to decide on improvements to work practices and processes\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "assist development of at least three different policies and procedures to manage all aspects of employment separation and termination according to legislative and organisational requirements",
        "on at least one occasion, coordinate the separation or termination of an employee.",
        "In the course of the above, the candidate must:",
        "communicate effectively with employees to ensure they are aware of their rights and responsibilities",
        "ensure staff have an appropriate skill-sets to conduct terminations",
        "use data from exit interviews to suggest organisational improvements."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\nkey aspects of disciplinary procedures\nkey features of employment contracts including terms and conditions\nrelevant procedures and grounds for dismissal, suspension, voluntary termination, retirement and redundancy\nrelevant industrial relations and employee dismissal legislation\nmethods of obtaining feedback and suggesting improvements to organisational operations.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBINS512",
      "name": "Monitor business records systems",
      "description": "Application:\nThis unit describes the skills and knowledge required to set up the operational frameworks for the creation, capture and use of records and to monitor and review these frameworks and activities within an organisation.\nThe unit applies to individuals who work closely with other staff members in an organisation and may also have a degree of individual responsibility and autonomy. They use a range of organisational, analytical and managerial techniques to perform their work in business and records systems or in specialist information management environments, such as archives.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Identify requirements or modifications: 1.1 Identify and document core business, supporting activities, resources, business and social context, using observation and consultation\n1.2 Identify organisational functions and activities for which records must be kept \n1.3 Identify security and access requirements for records system content from analysis of organisation’s activities\n1.4 Analyse organisational reporting and accountability requirements in the context of the business documentation\n2. Develop information management system: 2.1 Select or develop a metadata standard to be applied to all records as they are captured into the records management system\n2.2 Specify technological, internal controls, maintenance, disposal and updating requirements of prospective records system according to scale and nature of business operations\n2.3 Select cost structure for business or records systems relevant to size, nature, and organisational cash flow requirements\n3. Develop an implementation plan: 3.1 Identify and document information management responsibilities of individual personnel or organisational units\n3.2 Develop measurable performance indicators for information management activities\n3.3 Contribute to the development of policies and procedures for capturing and controlling records\n3.4 Communicate implementation plan to users of the system and other relevant organisational staff\n4. Monitor and review business or records system: 4.1 Monitor records system and notify staff according to implementation plan\n4.2 Record details of variation from implementation plan\n4.3 Provide required reports to relevant authority relating to use and maintenance of records\n4.4 Designate responsibilities to staff for record creation and capture activities in accordance with organisational policies and procedures\n5. Review and respond to problems and changes: 5.1 Use monitoring reports and external events to identify any issues that require a systemic response \n5.2 Make recommendations for revisions to systems, procedures, and strategic plans in response to identified issues\n5.3 Make and review amendments to system and implementation plan, where required\n5.4 Prepare recommendations for system amendments, planning and implementation\n5.5 Authorise procedures for using the business or records systems, and for any subsequent amendments to the procedures\nSkill: Description\nReading: Evaluates and interprets information from a range of relevant sources and identifies relevant and key information\nWriting: Creates documents to convey information and instructions using language and format appropriate to text and audience\nOral Communication: Uses active listening and questioning techniques to confirm and clarify information\nCommunicates using words and non-verbal features appropriate to the audience and context\nNumeracy: Interprets, compares and contrasts numerical data to determine needs\nUses numerical systems associated with record storage systems\nPlanning and organising: Uses understanding of organisational requirements in planning an appropriate information management system \nSequences and schedules tasks required to achieve outcomes and manages relevant communication\nTechnology: Uses digital systems to develop and monitor business records system\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "develop, implement and review one records system for an organisation or work area.",
        "In the course of the above, the candidate must:",
        "identify the requirement for a business records system",
        "document the steps used to determine the criteria for a records system appropriate to the organisation’s business functions and reporting requirements",
        "develop an implementation plan."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\nkey principles and processes of records management and records management systems\ninternal controls required of the business or records system\nkey characteristics of the organisational functions, structure and culture relevant to implementation of records system\norganisational policies and procedures relevant to performance evidence\ncommon problems relating to business records systems that require a systemic response.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBMKG541",
      "name": "Identify and evaluate marketing opportunities",
      "description": "Application:\nThis unit describes the skills and knowledge required to identify, evaluate and take advantage of marketing opportunities by analysing market data, distinguishing characteristics of possible markets and assessing viability of changes to operations.\nThe unit applies to individuals working in a supervisory or management marketing or advertising role within a marketing or advertising team or media organisation.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Explore marketing opportunities: 1.1 Analyse information on market and business needs for marketing opportunities\n1.2 Identify potential new markets\n1.3 Apply innovative approaches relevant to the development of potential marketing opportunities\n2. Evaluate marketing opportunities: 2.1 Identify and analyse opportunities for organisational fit according to organisational goals and capabilities\n2.2 Analyse the viability of each opportunity \n2.3 Determine probable return on investment and potential competitors\n2.4 Select marketing opportunities according to outcomes of viability analysis, return on investment and competition\n3. Evaluate required changes to current operations: 3.1 Seek feedback from relevant stakeholders\n3.2 Incorporate feedback received for current operations and take advantage of viable marketing opportunities\n3.3 Review current operations and document changes needed \n3.4 Identify resource requirements for marketing opportunities\n3.5 Document and communicate viability of marketing opportunities to key stakeholders\nSkill: Description\nReading: Evaluates and comprehends textual information from a range of sources and draws own conclusions\nWriting: Integrates information from a number of sources to develop material that supports purposes of documentation using suitable grammatical structure and clear, logical language\nOral Communication: Presents opinions, ideas and organisational requirements clearly and creatively using language and presentation techniques appropriate to audience and environment\nElicits views and opinions of others by listening and questioning\nNumeracy: Evaluates financial and marketing data using whole numbers, decimals and percentages to make accurate calculations\nInitiative and enterprise: Evaluates outcomes of decisions to identify opportunities for improvement\nDevelops new and innovative ideas through exploration, analysis and critical thinking\nSelf-management: Identifies and follows explicit and implicit organisational protocols and meets expectations associated with own role\nPlanning and organising: Develops plans to manage relatively complex tasks with an awareness of how they may contribute to longer-term operational and strategic goals\nMakes decisions by systematically analysing information, identifying and evaluating options against set criteria, and choosing most appropriate option\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "identify and evaluate at least three marketing opportunities.",
        "In the course of the above, the candidate must:",
        "comply with organisational policies and procedures",
        "communicate and document potential of identified marketing opportunity to relevant stakeholders."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\nkey provisions of relevant legislation, codes of practice and national standards affecting marketing operations\nhow to calculate the financial viability of marketing opportunities\nreturn on investment\nfinancial and marketing data\norganisational structure, products and services\nprinciples of marketing and marketing mix\nstatistical methods and techniques to evaluate marketing opportunities, including forecasting techniques.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBMKG546",
      "name": "Develop social media engagement plans",
      "description": "Application:\nThis unit describes the skills and knowledge required to effectively develop social media engagement plans with a preferred target audience.\nThe unit applies to individuals working in a variety of marketing and communications occupational roles who have responsibility for developing social media plans and facilitating social engagement on behalf of a business or organisation.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Prepare to develop social media strategy: 1.1 Identify client requirements and characteristics of target audience for social media strategy \n1.2 Research and document characteristics and online habits of the target audience according to organisational policy \n1.3 Identify and analyse common responses to triggers, interventions, and preferred and avoided behaviours on social media platforms and applications \n1.4 Evaluate market research and identify the attention span and retention characteristics of alternative content types and engagement patterns\n1.5 Document research results and deliver to appropriate personnel\n2. Devise social media engagement strategy: 2.1 Select preferred social media platforms and applications according to organisation, client and audience requirements\n2.2 Select content and engagement interventions for target audience according to client requirements\n2.3 Establish metrics for social media performance according to organisational strategies\n2.4 Identify and develop mitigation solution for risks to brand and message integrity and trust of target audience\n3. Facilitate content delivery: 3.1 Develop relevant content and schedule release for maximising target audience attention \n3.2 Engage with target audience on chosen social media platforms\n3.3 Identify and implement relevant tools and automate the engagement process in applicable delivery areas \n3.4 Apply identified metrics for posts, responses and updates\n4. Monitor and evaluate social media engagement: 4.1 Develop plan for ongoing review of performance using a social media analytics service\n4.2 Identify gaps in performance against requirements and adjust as necessary according to organisational plan\n4.3 Evaluate and report on social media engagement effectiveness for delivery to relevant personnel\nSkill: Description\nReading: Identifies and analyses complex texts to determine organisational and client requirements\nReviews relevant information to understand the audience of the social media engagement\nWriting: Integrates information from a number of sources to develop materials suitable for purpose and audience\nOral Communication: Presents information and seeks input using structure and language appropriate to audience \nUses questioning and listening to confirm understanding\nNumeracy: Analyses data from a range of sources to effectively understand audience, and define strategy success\nInitiative and enterprise: Draws insights from information, enabling increased understanding within the organisation and opportunities for improvement\nSelf-management: Adheres to and job requirements relevant to social media engagement\nResponds rapidly and shows flexibility by taking advantage of the organic nature of social media where it is advantageous for organisation and client\nPlanning and organising: Plans and organises workload and processes to ensure compliance with organisational policies and procedures\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.\nRelease 2: This version first released with BSB Business Services Training Package Version 7.1. \nRelease created to amend typographical error within the knowledge evidence.",
      "learning_outcomes": [
        "develop, review and update a social media engagement plan for an organisation or work area.",
        "In the course of the above, the candidate must:",
        "specify a target audience for social media engagement according to client or organisational requirements",
        "set measurable metrics for determining success",
        "research online behaviours and characteristics of target audience and identify typical responses and journeys",
        "review and select social media platforms and applications to meet requirements",
        "develop and schedule release of relevant content that aligns to strategy",
        "develop a plan for social media interactions including requirements for consistent messaging and automate engagement process where possible",
        "monitor and react positively to changes in the social media space."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\nfeatures of existing legislation and policy relevant to social media\nfeatures of existing social media platforms and their relevance to key industry functions\nbenefits of consistent messaging in social media, including branding and the development of trust\nmethods of engaging target audience on social media including:\noffering personalised responses to target audience questions\ncomments\nreactions\ntypical response characteristics of users to common social media interventions\nfeatures of existing tools and techniques used to engage users on social media\nperformance measures commonly used to evaluate social media engagement\nrelevant organisational strategies, policies, and procedures.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBMKG548",
      "name": "Forecast international market and business needs",
      "description": "Application:\nThis unit describes the skills and knowledge required to forecast, evaluate and draw insights from international market intelligence to promote business development.\nThe unit applies to individuals who with a considerable understanding of international business management and possess the managerial and supervisory skills to facilitate the effective functioning of business activities.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Prepare market intelligence: 1.1 Identify task objectives and target market\n1.2 Apply forecasting technique to Australian and international markets and identify trends and developments \n1.3 Collate and record information according to organisational objectives\n2. Evaluate information: 2.1 Identify organisational business capabilities and resources \n2.2 Analyse international market information \n2.3 Identify threats and opportunities for business development according to forecasting results\n3. Establish recommendations: 3.1 Identify potential organisational changes according to forecasting results  \n3.2 Prepare recommendations according to task requirements \n3.3 Discuss recommendations with relevant personnel\nSkill: Description\nNumeracy: Analyses and interprets complex business data to track strengths and weaknesses and to forecast trends\nReading: Identifies, analyses and compares complex textual information to interpret market developments and opportunities\nWriting: Produces complex reports forecasting market and business needs, using clear and well organised graphical and textual information\nPlanning and organising: Develops plans and uses effective organisational skills to complete tasks with an awareness of how they may contribute to longer term operational and strategic goals \nUses systematic and analytical decision- making processes to gather and evaluate data in complex non-routine situations\nTechnology: Uses a range of digital applications to access and filter data, extract, organise, integrate and share relevant information\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "forecast and evaluate an international market on at least one occasion, and forecast and evaluate business needs.",
        "In the course of the above, the candidate must:",
        "comply with organisational policies and procedures",
        "develop and discuss recommendations to improve business with relevant personnel."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\nforecasting techniques including:\nbottom-up forecasting\ndelphi techniques\nmodel building\nprojection\nscenario planning\nintention surveys\ntop-down forecasting\nsources of information relevant to forecasting international market and business needs including:\ncore activities, customer base, business value sand current business direction\nmarketing and other business performance\ncomparative market information\nchanges in technology\ndemographic changes\npolitical events\nsocial and cultural factors\neconomic trends\ngovernment activities and legislative changes\nindustry trends\nimpacts of international market performance on internal business operations\nlegislative and regulatory context of organisation in relation to forecasting market and business needs\norganisational information for forecasting international market and business needs including core activities and capabilities\nsoftware commonly used in marketing forecasting and analysis.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBMKG549",
      "name": "Profile and analyse consumer behaviour for international markets",
      "description": "Application:\nThis unit describes the skills and knowledge required to profile and analyse consumer behaviours for a range of international markets.\nThe unit applies to individuals who have managerial responsibility for selecting and confirming appropriate international markets by identifying target markets, analysing customer behaviour and recommending strategies.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Prepare to profile: 1.1 Identify task objectives and international target markets \n1.2 Review past marketing plans, strategies, campaigns and positioning of products and services, where possible\n1.3 Identify and select targeting strategy according to task and organisational requirements\n1.4 Develop consumer profile for the selected market\n1.5 Develop positioning strategy\n2. Analyse consumer behaviours: 2.1 Research consumer behaviours for target international markets \n2.2 Analyse consumer needs and interest in target international markets \n2.3 Assess individual, social, cultural, lifestyle influences on consumer behaviour\n3. Develop and recommend strategies: 3.1 Determine strategies for profiling and analysing consumer behaviours \n3.2 Seek areas for improvement to developed strategy in consultation with relevant personnel \n3.3 Present strategy to relevant stakeholders for feedback according to task requirements\nSkill: Description\nNumeracy: Interprets trends to inform understanding of consumer needs \nPerforms calculations to ensure plans meet budgetary requirements\nOral communication: Presents information using language and features appropriate to the context and audience\nReading: Identifies and analyses complex texts to assess consumer behaviour and determine legislative requirements\nWriting: Produces comprehensive rationale using language and structure appropriate to context and audience\nSelf-management: Adheres to organisational objectives, policies and requirements \nConsiders own role in terms of its contribution to broader goals of work environment\nPlanning and organising: Uses effective organisational skills to complete tasks with an awareness of how they may contribute to longer-term operational and strategic goals \nUses analytical processes to gather and access information required to decide on most appropriate marketing strategies\nTechnology: Uses digital tools to gather and analyse data about consumer behaviours\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "profile and analyse consumer behaviour for at least two international markets according to organisational objectives."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\ncultural aspects relevant to international markets profiled\nconsumer profile content including consumer characteristics in standard statistical terms\nmarket profiling techniques and related software programs\ninfluence on consumer behaviour, including:\nindividual\nsocial\ncultural\nlifestyle\nkey provisions of relevant legislation affecting consumer behaviours for products and services including:\nTrade Practices Act\nWorld Trade Organisation\nPrivacy Act\nsources of information on international markets\nsegment descriptors to define international target markets.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBMKG550",
      "name": "Promote products and services to international markets",
      "description": "Application:\nThis unit describes the skills and knowledge required to promote products and services to international markets in line with the organisational marketing plan and strategy for a specified target market.\nThe unit applies to individuals who have a managerial-level responsibility for promoting products and services to international markets. This includes planning, coordinating and reviewing of promotional activities. These individuals use well-developed problem-solving skills to create solutions to unpredictable problems through analysis and evaluation of information from a variety of sources.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Plan promotion: 1.1 Identify and confirm task objectives and requirements, budget timeline, and target market with relevant stakeholders \n1.2 Access relevant information for assistance in planning \n1.3 Develop a potential range of promotional activities for international target market according to regulatory and organisational guidelines, international requirements and promotional plans\n1.4 Select activities according to task requirements \n1.5 Document selected promotional activities for approval for implementation\n2. Coordinate promotion: 2.1 Identify and prepare personnel and resources for implementation of promotional activity \n2.2 Implement marketing activity according to legal, regulatory and organisational requirements \n2.3 Assign responsibilities for ongoing evaluation of promotional activity \n2.4 Monitor and address variations between expected and actual performance of promotion according to marketing objectives and organisational policy\n3. Review promotion: 3.1 Gather feedback on marketing mix for improvements in target and outcomes \n3.2 Analyse promotional outcomes against costs and timelines \n3.3 Identify process improvements for future international marketing opportunities \n3.4 Prepare recommendations for future direction of internationally based promotional activities\nSkill: Description\nNumeracy: Collates and interprets numeric information to analyse trend data, targets and resource requirements\nReading: Interprets textual information obtained from a range of sources and determines how content may be applied to organisational requirement\nWriting: Communicates with others using clear and detailed language to request specific information and brief relevant personnel\nIntegrates information from a number of sources to develop material that supports purposes and format of documentation using suitable grammatical structure and clear, logical language\nSelf-management: Takes personal responsibility for adherence to legal and regulatory responsibilities relevant in own work context\nIdentifies and follows explicit and implicit protocols and meets expectations associated with own role\nIdentifies and takes responsibility for addressing predictable and some less predictable problems in familiar work contexts\nPlanning and organising: Develops plans to manage tasks with an awareness of how they may contribute to longer-term operational and strategic goals\nTechnology: Uses a range of digital applications to access data, extract, organise, and integrate relevant information\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "promote at least two products and services to international markets.",
        "In the course of the above, the candidate must:",
        "research, prepare and document culturally appropriate promotional activities",
        "manage resources",
        "monitor and address issues in promotion according to marketing objectives and organisational policy",
        "review and analyse promotional activity",
        "develop recommendations to improve internationally based promotional activities."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\nkey provisions of legislation, codes of practice and standards affecting international market promotion opportunities\npromotional activities relevant to international markets\nkey features of target international market including:\ncultural social, economic, political factors affecting marketing opportunity\nmedia channels available\nlegislative requirements\nstrategies for building and maintaining client relationships\nnational, bilateral or regional trade agreements\nWorld Trade Organisation rules\nmarketing concepts, principles and strategies\nevaluation principles and strategies.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBOPS404",
      "name": "Implement customer service strategies",
      "description": "Application:\nThis unit describes the skills and knowledge required to advise, carry out and evaluate customer service strategies.\nThe unit applies to individuals who have well developed skills and a broad knowledge of customer service strategies for addressing customer needs and problems. Individuals may provide guidance or delegate work related tasks to others.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Advise on customer service needs: 1.1 Identify organisational customer service objectives and customer needs \n1.2 Assess and clarify customer requirements \n1.3 Identify and diagnose problems with service delivery \n1.4 Develop options to improve customer service delivery according to organisational requirements \n1.5 Provide recommendations to promote improvement of customer service delivery\n2. Support implementation of customer service strategies: 2.1 Consult with relevant stakeholders to develop customer service strategies \n2.2 Assess customer service strategies and opportunities against customer service objectives\n2.3 Identify and allocate available budget resources to fulfil customer service objectives\n2.4 Action procedures to resolve customer difficulties and complaints according to organisational requirements\n3. Evaluate and report on customer service: 3.1 Review stakeholder satisfaction with service delivery according to organisational requirements\n3.2 Identify and report changes necessary to meet customer service objectives\n3.3 Prepare conclusions and recommendations on future directions of client service strategies\n3.4 Monitor systems, records and reporting procedures for changes to customer satisfaction\nSkill: Description\nReading: Reviews textual information and comprehends details that relate to the interests or requirements of the client and organisation\nWriting: Creates a range of formal texts using structure, grammar and clear and specialised language to describe customer needs, maintain information and support a particular position\nOral communication: Uses pace, intonation, intelligible pronunciation and listening and questioning techniques to interact effectively with others\nNumeracy: Recognises and interprets numerical information and performs calculations on familiar mathematical information\nEnterprise and Initiative: Recognises and applies organisational protocols and meets expectations associated with own work\nTeamwork: Uses a range of strategies to establish a sense of connection and build rapport with customers\nCollaborates with others contributing knowledge and skills to achieve joint outcomes\nPlanning and organising: Applies formal and logical processes when planning and implementing tasks\nApplies standard procedures when responding to familiar problems within own work context\nTechnology: Uses digital technologies to access, organise, present and store information relevant to own role\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "develop and implement at least two strategies to improve customer service delivery.",
        "In the course of the above, the candidate must:",
        "respond to and report on customer feedback and complaints",
        "review client satisfaction using verifiable data",
        "consult and communicate effectively with relevant people",
        "develop and implement strategies and methods to improve customer service delivery, including:",
        "budgeting",
        "promotion to staff",
        "documentation and follow up."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\ncustomer communication techniques\nprinciples of customer service\nsources of verified client information\ntechniques for identifying customer needs and reviewing customer satisfaction\norganisational business structure, products and services related to customer service\ntechniques for drawing insights from verifiable evidence to develop recommendations and conclusions\nproduct and service standards and best practice models.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBOPS501",
      "name": "Manage business resources",
      "description": "Application:\nThis unit describes the skills and knowledge required to manage resources according to planned business strategies. It includes analysing resource requirements, developing resource plans, allocating resources, and reviewing and reporting on resource usage.\nThe unit applies to individuals with a role in allocating and monitoring the use of physical and/or human resources to meet defined business objectives.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Analyse resource requirements: 1.1 Develop resource bids according to required outputs specified in business plans\n1.2 Consult with relevant stakeholders and determine the nature and level of resources required\n1.3 Analyse resource requirements and identify proposed costs and benefits\n1.4 Identify opportunities to share resources across business units within the organisation\n2. Develop resource plans: 2.1 Determine internal resourcing capabilities and external resourcing requirements\n2.2 Develop procedures for the evaluation of resource allocation and incorporate them in resource plans\n2.3 Identify risks and establish risk management processes\n2.4 Obtain required approvals from relevant personnel\n3. Allocate resources: 3.1 Identify and adhere to organisational policies and procedures for resource allocation\n3.2 Manage resource allocation according to business unit objectives\n3.3 Negotiate and obtain resources within required timeframe according to business unit objectives\n3.4 Develop and implement systems for monitoring resource usage\n4. Review and report on resource usage: 4.1 Develop and implement procedures to review resource allocation against business unit objectives\n4.2 Suggest improvements to work practices for the efficient use of resources \n4.3 Monitor compliance with program and project budgets and take corrective action where necessary\n4.4 Prepare report that indicates the level of performance achieved and any action taken to adjust or rectify procedures in meeting service and product delivery standards\nSkill: Description\nReading: Interprets textual information including legislation and organisational policy, to plan, implement and review resource requirements\nAnalyses organisational information to assess resource usage practices\nWriting: Develops organisational texts including proposals, reports and plans according to organisational requirements\nOral communication: Participates in spoken exchanges with stakeholders using structure and language appropriate to context and audience\nNumeracy: Selects and uses familiar mathematical techniques to determine costs and benefits associated with strategic resource decisions\nDefines timeframes according to schedule requirements\nSelects and uses familiar mathematical techniques to organise timely supply of required resources as well as identify budgetary information and monitor performance\nEnterprise and initiative: Contribute to the development of organisational policies and procedures\nAdheres to legal requirements and organisational policies and procedures\nTeamwork: Collaborates and negotiates with others to achieve required outcomes\nPlanning and organising: Accepts responsibility for planning and sequencing complex tasks to achieve organisational requirements\nDevelops plans and systems to manage resource allocation\nSystematically gathers and analyses all relevant information, evaluates options and conducts reviews to inform recommendations about resource usage improvements\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "develop, implement and review at least three resource plans.",
        "In the course of the above, the candidate must:",
        "consult with stakeholders and analyse information to determine the nature and level of resources required to achieve business objectives",
        "plan for, acquire and allocate the resources, incorporating strategies to maximise efficiency and manage risk",
        "develop and implement systems to:",
        "incorporate efficient use of resources into work practices",
        "monitor resource use against budgets and business objectives",
        "prepare a report that indicates the level of performance achieved and any adjustments needed to achieve service and product delivery standards."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\nlegislative and regulatory context of the organisation in relation to managing resources\ncontents of resource plans including:\nacquisition and allocation of resources\ntimelines and the relationship to business strategies\ncontingency plans and processes\ncosts and budgets\nresource acquisition processes\nmanaging finance, including project budgets\nresource allocation review procedures\nobjectives of business unit\ntypical risks associated with managing business resources and risk management strategies\nprocedures for risk management, including requirements for the consideration of potential changes in government priorities\nkey elements and sources of information required to monitor usage of:\nphysical resources\nhuman resources.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBOPS502",
      "name": "Manage business operational plans",
      "description": "Application:\nThis unit describes the skills and knowledge required to develop and monitor the implementation of operational plans to support efficient and effective workplace practices and organisational productivity and profitability.\nThe unit applies to individuals who manage the work of others and operate within the parameters of a broader strategic and/or business plans.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Establish operational plan: 1.1 Research, analyse and document resource requirements \n1.2 Develop operational plan in consultation with, and with approval from, relevant stakeholders \n1.3 Develop contingencies for operational plan \n1.4 Explain plan to relevant work teams\n2. Manage resource acquisition: 2.1 Confirm that employees are recruited and inducted according to the organisation’s human resources management policies, practices and procedures\n2.2 Confirm that physical resources and services are acquired according to the organisation’s policies, practices and procedures \n2.3 Identify and incorporate requirements for intellectual property rights and responsibilities related to acquisition of resources\n3. Monitor and review operational performance: 3.1 Assess progress of operational plan in achieving profit and productivity plans and targets\n3.2 Identify areas of under-performance, recommend solutions and rectify the situation\n3.3 Plan and implement relevant processes for ongoing monitoring and confirm that support is provided for individuals and teams \n3.4 Negotiate recommendations for variations to operational plans and gain approval from designated persons\nSkill: Description\nReading: Gathers, interprets and analyses workplace documentation to determine requirements for the operational plan\nWriting: Develops and documents a range of detailed texts relating to the management of an operational plan according to organisational requirements\nOral communication: Presents information to a range of audiences using appropriate register, vocabulary and paralinguistic features\nListens and comprehends information from a variety of spoken exchanges with clients, co-workers and other stakeholders\nNumeracy: Selects and uses mathematical problem-solving strategies to organise resource requirements, performance benchmarks and financial viability of the operational plan\nEnterprise and initiative: Monitors adherence to organisational policies, procedures and considers own role in terms of its contribution to broader goals of the work environment\nTeamwork: Collaborates with others to achieve joint outcomes, playing an active role in facilitating effective group interaction, influencing direction and taking a leadership role on occasion\nPlanning and organising: Takes responsibility for developing and implementing systems and processes to achieve organisational objectives, seeking advice, feedback and support as required to assist in the development and planning phase\nSequences and schedules complex activities, monitors implementation, and manages relevant communication\nProblem solving: Uses systematic analytical processes to aid decision making, identify potential problems and generate contingency plans or solutions\nTechnology: Demonstrates awareness of the importance of data security in a digital environment\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "manage an operational plan for at least one business or work area.",
        "In the course of the above, the candidate must:",
        "develop and implement an operational plan using a variety of information sources and consultation including:",
        "resource requirements",
        "key performance indicators",
        "monitoring processes",
        "contingency plans",
        "communicate with stakeholders to explain the plan and supporting information, seek approvals, negotiate variations and engage work teams",
        "confirm existence of relevant strategies, including strategies relating to:",
        "recruiting, inducting and developing personnel",
        "acquiring physical resources and services",
        "protecting intellectual property",
        "making variations to the plan",
        "monitoring and documenting performance."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\nstakeholders involved in development and management of operations plan including escalation points, colleagues and specialist resource managers\nkey information sources for proposal development and presentation including resource requirement specialists\nconsultation processes\ncontent of operational plans, including:\nprocurement processes\nemployee recruitment and induction strategies\nphysical resource and service acquisition strategies\nkey indicators of organisational performance\nbudget and actual financial relating to profit and productivity\nmethods for preparing operational plans and contingency plans\nrole of an operational plan in achieving an organisation’s objectives\nprocedures and records associated with documenting performance\napproaches for developing key performance indicators to meet business objectives\nlegislative and regulatory framework relating to the development and implementation of operational plan of the organisation, including:\nfair trading laws\nwork health and safety\norganisational policies, practices and procedures that relate to the operational plan.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBOPS503",
      "name": "Develop administrative systems",
      "description": "Application:\nThis unit describes the skills and knowledge required to plan for or review the requirements of administrative systems and procedures for implementing, monitoring and reviewing the system.\nThe unit applies to individuals employed in a range of work environments in senior administrative roles.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Plan administrative system: 1.1 Identify requirements for update to the administrative system according to organisational and budgetary requirements\n1.2 Consult with stakeholders and verify identified requirements and modifications \n1.3 Obtain quotations from suppliers or developers to address system requirements according to organisational policy and procedures\n1.4 Select supplier or developer according to organisational policies and procedures\n2. Implement administrative system: 2.1 Identify and develop implementation strategies in consultation with staff\n2.2 Implement system according to organisational and legislative requirements \n2.3 Support staff and provide training on the use of the system \n2.4 Manage contingencies and support minimal impact on users\n3. Monitor administrative system: 3.1 Monitor system for usage, security and output according to organisational requirements\n3.2 Modify system to meet changing needs according to organisational requirements\n3.3 Identify further modifications and notify users\nSkill: Description\nLearning: Reinforces own knowledge and skills by training and mentoring others\nReading: Extracts, analyses and evaluates information from complex texts, including organisational policies and procedures\nWriting: Creates instructional texts using grammatical structures and vocabulary appropriate to audience and context\nOral communication: Presents complex information adjusting presentation style and vocabulary to suit the audience\nNumeracy: Recognises and interprets numerical information related to budgets\nEnterprise and initiative: Develops systems to meet organisational and legislative requirements\nAnticipates potential problems and implements contingency plans as soon as warning signs are recognised\nTeamwork: Selects the appropriate form, channel and mode of communication for a specific purpose relevant to own role\nCollaborates with others to achieve joint outcomes, providing guidance to others where necessary\nPlanning and organising: Applies formal processes when planning complex tasks, producing plans with logically sequenced steps, reflecting an awareness of time constraints\nMonitors progress of plans and changes them to meet new demands or priorities\nTechnology: Uses and investigates new digital technologies and applications to manage and manipulate data\nDemonstrates awareness of the importance of data security in a digital environment\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "develop at least one administrative system.",
        "In the course of the above, the candidate must:",
        "work with relevant personnel and stakeholders to identify administrative system improvements",
        "document requirements",
        "provide training and support for staff to use the system",
        "monitor the new system and identify future improvements and staff training needs."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\nlegislative and organisational policies and procedures for reviewing administrative systems\nstakeholders involved in organisational administrative systems including system users\ntraining procedures for communicating new system information to staff.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBOPS504",
      "name": "Manage business risk",
      "description": "Application:\nThis unit describes skills and knowledge required to manage business risks in a range of contexts across an organisation or for a specific business unit or area in any industry setting.\nThe unit applies to individuals who are working in positions of authority and who are approved to implement change across the organisation, business unit, program or project area. They may or may not have responsibility for directly supervising others.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Establish risk context: 1.1 Evaluate organisational processes, procedures and requirements and determine scope for risk management process \n1.2 Review strengths and weaknesses of existing arrangements \n1.3 Document critical success factors, goals and objectives for area included in scope \n1.4 Communicate risk management process to relevant stakeholders\n2. Identify risks: 2.1 Invite stakeholders to assist in the identification of risks\n2.2 Research risks that may apply to scope\n2.3 Document risks that apply to the scope, in consultation with relevant parties\n3. Analyse risks: 3.1 Assess likelihood of risks occurring\n3.2 Assess impact or consequence if risks occur\n3.3 Evaluate and prioritise risks for treatment\n4. Select and implement treatments: 4.1 Determine and select from options for treating risks\n4.2 Develop action plan for implementing risk treatment\n4.3 Communicate risk management processes to relevant parties\n4.4 Implement action plan according to organisational policies and procedures\n4.5 Monitor and evaluate risk management process\nSkill: Description\nReading: Synthesises a variety of relatively complex texts\nGathers, interprets and analyses textual information from a range of sources to identify relevant information\nWriting: Develops textual material and organises content in a manner that effectively documents risk management analysis and assessment priorities and processes\nOral communication: Participates in interactions with stakeholders using questioning and listening to elicit opinions, and to confirm and clarify understanding\nNumeracy: Uses numerical tools to assess risk and uses numerical data to review plans\nTeamwork: Selects appropriate conventions and protocols when communicating with stakeholders about risk management\nConsults and negotiates with stakeholders about risk management processes and outcomes\nPlanning and organising: Sequences and schedules a range of routine and complex activities, monitors implementation, evaluates processes and manages relevant communication\nSystematically analyses information to decide on appropriate risk management treatments\nRefers to organisational processes, procedures and requirements when making decisions about risk management\nTechnology: Uses digital technologies and systems to access information, document plans and communicate with others\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "lead at least one risk management process for an organisation or work area.",
        "In the course of the above, the candidate must:",
        "analyse information from a range of sources to identify the scope and context of the risk management process, including:",
        "stakeholder analysis",
        "political, economic, social, legal, technological and policy context",
        "current arrangements",
        "objectives and critical success factors for the area included in scope",
        "risks that may apply to scope",
        "consult and communicate with stakeholders to identify and assess risks, determine appropriate risk treatment actions and priorities and explain the risk management processes",
        "develop and implement an action plan to treat risks",
        "monitor and evaluate the action plan and risk management process",
        "maintain documentation."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\nlegislative and regulatory context of the organisation in relation to risk management\norganisational policies, procedures and processes for risk management, including document storage\ntypes of business risks\noptions for treating risks\nrisk management process\npurpose and key elements of current risk management standards\ntools and techniques to identify risks to scope risk management processes.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBOPS505",
      "name": "Manage organisational customer service",
      "description": "Application:\nThis unit describes the skills and knowledge required to develop strategies to manage organisational systems that ensure products and services are delivered and maintained to standards agreed by the organisation.\nThe unit applies to individuals who supervise customer service provided by others within an organisation. At this level, individuals must exercise considerable discretion and judgement, using a range of problem solving and decision making strategies.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Establish customer requirements: 1.1 Consult with customers to identify customer service requirements \n1.2 Integrate customer feedback into organisation’s business plan \n1.3 Identify and procure resources required to address customer service requirements\n2. Deliver quality products and services: 2.1 Deliver product and service according to customer specifications within organisation’s business plan\n2.2 Monitor team performance and assess against the organisation’s quality and delivery standards\n2.3 Support colleagues to overcome difficulties in meeting customer service standards\n3. Evaluate customer service: 3.1 Develop and use strategies for monitoring progress against product and service targets and standards\n3.2 Develop and use strategies for obtaining customer feedback on provision of product and service\n3.3 Adapt delivery of customer product and service in consultation with relevant individuals and groups\n3.4 Manage records, reports and recommendations within the organisation’s systems and processes\nSkill: Description\nReading: Interprets and analyses textual information from a variety of sources and applies the knowledge that has been gained to evaluate standards for organisation’s products and services\nWriting: Produces a range of text types to convey information, requirements or recommendations matching style of writing to purpose and audience\nOral communication: Clearly articulates systems and standards in a team environment using language suitable to diverse audiences\nUses listening and questioning techniques to obtain feedback and confirm understanding\nNumeracy: Interprets and comprehends mathematical information in organisation’s business and customer service plans\nPlanning and organising: Recognises and applies organisational protocols and meets expectations associated with own work\nTeamwork: Identifies and uses appropriate conventions and protocols when communicating with colleagues and customers\nCollaborates with others, taking into account their strengths and experience, to achieve desired outcomes\nProvides support in field of expertise to team\nEnterprise and initiative: Develops and implements plans using logical processes and monitors and evaluates progress against stated goals\nProblem solving: Accepts responsibility for addressing complex or non-routine difficulties, applying problem solving processes in determining a solution\nTechnology: Uses digital technology to access, organise and present information in a format that meets requirements\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "develop and review strategy for delivering and monitoring quality customer service for an organisation or work area.",
        "In the course of the above, the candidate must:",
        "implement quality customer service policies and procedures",
        "identify and resolve system problems relating to poor customer service",
        "assist teams to meet customer service requirements",
        "develop, procure and use human and physical resources to support quality customer service delivery."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\nlegislative and regulatory frameworks governing customer service\nelements of effective customer service including quality, time and cost\norganisational policies and procedures for customer service and handling customer complaints\nrelevant service standards and best practice models\nkey principles of public relations and product promotion\ncommon techniques for solving complaints\nprinciples and techniques involved in managing:\ncustomer behaviour\nspecific customer needs\ncustomer research\ncustomer relations\nongoing product and service quality\nproblem identification and resolution\nquality customer service delivery\nrecord keeping and management methods\nstrategies for monitoring, managing and introducing ways to improve customer service relationships\nstrategies to obtain customer feedback.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBOPS601",
      "name": "Develop and implement business plans",
      "description": "Application:\nThis unit describes the skills and knowledge required to lead a business operation that covers the steps required to develop and implement business plans.\nThe unit applies to individuals who are running an organisation or who take a senior role in determining the effective functioning and success of the organisation. These individuals may oversee the work of a number of teams and other managers.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Establish business plan: 1.1 Identify organisational and legislative frameworks relevant to development of a business plan \n1.2 Review market requirements for the organisation’s products and service\n1.3 Identify and assess business requirements, objectives, competitors and established plans\n1.4 Develop performance objectives and measures for business plan, in consultation with relevant stakeholders\n1.5 Identify financial, human and physical resource requirements for the business \n1.6 Develop business plan\n2. Implement business plan: 2.1 Communicate business plan to all relevant stakeholders\n2.2 Confirm skilled labour is available to implement plan\n2.3 Test performance measurement systems and refine, where required\n2.4 Prepare reports on key aspects of the business \n2.5 Report system failures, product and service failures and variances to the business plan as they occur\n3. Respond to performance data: 3.1 Analyse performance reports against planned objectives\n3.2 Review performance indicators and refine, where required\n3.3 Identify and coach under-performing staff \n3.4 Establish ongoing review processes\nSkill: Description\nReading: Gathers, interprets and analyses textual information when developing the business plan and monitoring operational performance\nWriting: Communicates relationships between ideas and information, matching style of writing to purpose and audience\nResearches, plans and prepares business plan for relevant stakeholders\nOral communication: Presents information and seeks advice using language and features appropriate to audience\nParticipates in discussions using listening and questioning to elicit the views of others and to clarify or confirm understanding\nNumeracy: Extracts and evaluates mathematical information to review the market, research competitors and review pricing structures\nEnterprise and initiative: Takes full responsibility for identifying and complying with legislative requirements applicable to self and the organisation\nTeamwork: Collaborates with others to achieve joint outcomes, playing an active role in facilitating effective group interaction, influencing direction and taking a leadership role\nProvides support in field of expertise to colleagues, as required\nPlanning and organising: Sequences and schedules complex activities, monitors implementation and manages relevant communication\nSystematically gathers and analyses all relevant information and evaluates options in order to monitor performance and identify opportunities for improvement\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "develop and implement at least one business plan.",
        "In the course of the above, the candidate must:",
        "analyse and research business vision, mission, values, objectives, goals, competitors, financial targets, management arrangements and marketing approaches",
        "write a business plan, including:",
        "description of the business",
        "products and services",
        "financial, physical and human resource requirements",
        "regulatory requirements",
        "marketing strategy",
        "financial indicators",
        "productivity and performance targets for key result areas",
        "monitor and respond to business performance including evaluation of performance against key results indicators",
        "consult, communicate with and report to relevant stakeholders",
        "provide analysis of the strengths and weaknesses of a business plan."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\norganisational and legislative frameworks required for the development of business plans, including:\npre-existing strategic, business and operational plans\nbusiness vision, mission, values and objectives\npermits or licences that may be required for new activity\nprocesses for developing and monitoring business plans\ncustomer needs and budgeting information\nperformance objectives and measures, including key results indicators\nstakeholders involved in the development of business plans.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBPMG430",
      "name": "Undertake project work",
      "description": "Application:\nThis unit describes the skills and knowledge required to undertake a minor project or a section of a larger project. It covers developing a project plan, administering and monitoring the project, finalising the project and reviewing the project to identify lessons learned for application to future projects.\nThe unit applies to individuals who play a significant role in ensuring a project meets timelines, quality standards, budgetary limits and other requirements set for the project.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Establish project parameters: 1.1 Identify project scope \n1.2 Define project stakeholders\n1.3 Seek clarification from delegating authority of issues related to project and project parameters\n1.4 Identify responsibilities of relevant stakeholders and reporting requirements\n1.5 Clarify relationship of project to other projects and to the objectives of the organisation\n1.6 Identify availability and access of resources for undertaking the project\n2. Develop project plan: 2.1 Identify risks and develop a risk management plan for project, including Work Health and Safety (WHS)\n2.2 Develop project budget and timeframe and seek approval from relevant stakeholders \n2.3 Consult team members and apply their views in planning the project\n2.4 Identify and access appropriate project management tools\n2.5 Develop project plan according to project parameters and deliverables\n2.6 Finalise project plan and gain necessary approvals to commence project according to documented plan\n3. Administer and monitor project: 3.1 Communicate to project team members their responsibilities and project requirements\n3.2 Establish and maintain required recordkeeping systems throughout the project\n3.3 Implement and monitor plans for managing the project\n3.4 Undertake risk management as required\n4. Finalise and review project: 4.1 Complete financial recordkeeping associated with project and confirm according to agreed budget\n4.2 Complete project documentation and obtain sign-offs for concluding project\n4.3 Review project outcomes and processes against the project scope and plan\n4.4 Document feedback and suggested improvements\nSKILL: DESCRIPTION\nReading: Organises, evaluates and critiques ideas and information from a range of complex texts\nWriting: Develops plans, reports and recommendations using vocabulary, structure and conventions appropriate to text\nEstablishes and maintains records according to organisational requirements\nNumeracy: Uses formal and some informal, oral and written mathematical language and representation to prepare and communicate budgetary and financial information\nOral communication: Participates in verbal discussions using clear language and appropriate features to present or seek information\nUsing listening and questioning skills to seek information and confirm understanding\nSelf-management: Identifies and responds to organisational and legislative/regulatory requirements\nTeamwork: Selects and uses appropriate communication protocols and practices to ensure shared understanding of project roles and expectations\nUses collaborative techniques to engage stakeholders in consultations and negotiations\nPlanning and organising: Develops and implements plans to manage projects that involve diverse stakeholders with potentially competing demands\nSystematically gathers and analyses all relevant information and evaluates options to make informed decisions\nEvaluates outcomes of decisions to identify opportunities for improvement\nTechnology: Uses digital technologies and applications to access, organise and share information\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "undertake project work on a minor project or a section of a larger project.",
        "In the course of the above, the candidate must:",
        "confirm the quality of project outcomes according to expectations of the organisation",
        "consult and communicate with relevant stakeholders to generate input and engagement in planning, implementing and reviewing the project",
        "provide support to team members to enable them to achieve deliverables and to transition them as appropriate at completion of the project."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\nproject management tools\ntypes of documents and other sources of information commonly used in defining the parameters of a project\nmission, goals, objectives and operations of the organisation\nrelevant legislation and regulations, including work health and safety (WHS) requirements, for project planning\nproject management processes according to policies and procedures of the organisation and including:\nlines of authority and approvals\nquality assurance\nhuman resources\nbudgets and finance\nrisk management\nrecordkeeping\nreporting.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBPMG530",
      "name": "Manage project scope",
      "description": "Application:\nThis unit describes the skills and knowledge required to determine and manage project scope. It involves obtaining project authorisation, developing a scope management plan, and managing the application of project scope controls.\nThe unit applies to individuals responsible for managing and leading a project in an organisation, business or as a consultant.\nNo licensing, legislative, regulatory or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Conduct project authorisation activities: 1.1 Develop and confirm procedures for project authorisation with an appropriate authority\n1.2 Obtain authorisation to expend resources\n1.3 Confirm project delegations and authorities in project governance arrangements\n2. Define project scope: 2.1 Identify and negotiate project boundaries with relevant stakeholders\n2.2 Establish measurable project benefits, outcomes and outputs\n2.3 Establish a shared understanding of desired project outcomes with relevant stakeholders\n2.4 Document scope management plan\n3. Manage project scope control process: 3.1 Implement agreed scope management procedures and processes\n3.2 Monitor impact of scope changes within established time, cost and quality constraints according to change control procedures\n3.3 Identify and document scope management issues and recommend improvements for future projects\nSKILL: DESCRIPTION\nReading: Interprets and analyses information from a range of complex texts\nWriting: Develops project documentation and procedures using formats and language appropriate to context\nOral Communication: Participates in discussions and negotiations using clear language and appropriate non-verbal features\nUses active listening and questioning to elicit views and opinions of others\nNumeracy: Interprets numerical information to determine project timelines and measure outcomes against project scope\nInitiative and enterprise: Adheres to organisational policies and procedures and considers own role in terms of its contribution to broader goals of work environment\nTeamwork: Identifies and uses appropriate conventions and protocols when communicating with diverse stakeholders\nCollaborates with others to achieve joint outcomes, playing an active role in negotiating and facilitating agreement\nPlanning and organising: Sequences and schedules complex activities, monitors implementation and manages relevant communications\nMakes a range of critical and non-critical decisions in relatively complex situations, taking a range of factors into account\nUses experience to reflect on ways variables impact outcomes and identify future improvements\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "manage project scope on at least two occasions.",
        "In the course of the above, the candidate must:",
        "collaborate with stakeholders to produce a scope-management plan",
        "review and document scope-management implementation and recommend improvements."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\ncomponents of a project scope-management plan\nfactors likely to impact the project scope\nformal change-control processes\nmethods for measuring work outcomes and progress against plans\nmethods for segmenting and documenting a work breakdown structure\nproblem areas likely to be encountered in scope management\nprocedures for reporting scope change\nproject life cycle and the significance of scope management\nproject management tools used for managing scope\nroles and responsibilities of project manager in relation to project planning\ntypes of project initiation documentation.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBPRC502",
      "name": "Manage supplier relationships",
      "description": "Application:\nThis unit describes the skills and knowledge required to manage relationships with suppliers of larger or multiple smaller procurement activities, where the relationship is of some significance to the organisation. It covers managing procurement agreements, resolving disagreements with suppliers, finalising agreements, and reviewing the performance of suppliers.\nIt applies to individuals who manage relationships with an organisation’s suppliers, and is typically undertaken by a senior procurement officer or procurement manager.\nNo licensing, legislative, regulatory or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Manage supplier agreements: 1.1 Monitor supplier performance throughout the duration of agreements in accordance with organisational policies and procedures\n1.2 Identify, monitor and manage risks in risk management plans throughout the duration of agreements\n1.3 Identify and address potential and actual performance issues\n1.4 Negotiate and resolve amendments to agreements as a consequence of addressing performance issues\n1.5 Seek and obtain approval for amendments from organisational management \n1.6 Communicate approved amendments to suppliers and relevant personnel\n2. Resolve disagreements with suppliers: 2.1 Identify and investigate causes of disagreements with suppliers and assess their validity\n2.2 Negotiate and resolve disagreements\n2.3 Establish transparent and trust with supplier to support relationship \n2.3 Document amendments to agreements as a consequence of the resolution of disagreements in accordance with organisational policies and procedures\n2.4 Seek and obtain approval for amendments from organisational management \n2.5 Communicate approved amendments to suppliers and relevant personnel\n3. Finalise agreements: 3.1 Confirm all supplier obligations as having been met prior to agreements being finalised\n3.2 Finalise procurement agreements on completion of contract\n3.3 Document arrangements to finalise agreements in accordance to organisational policies and procedures\n4. Review performance of suppliers: 4.1 Evaluate supplier performance against the requirements of procurement agreements\n4.2 Inform suppliers of evaluation outcomes as required\n4.3 Make recommendations about future use of suppliers to relevant personnel\nSkill: Description\nReading: Interprets textual information from a range of sources and determines how content may be applied to organisational requirements\nWriting: Documents amendments to agreements\nDevelops documentation according to organisational formats\nOral Communication: Communicates verbally using clear language and appropriate features to provide information to a variety of individuals\nUses active listening and questioning techniques to convey and clarify information\nNumeracy: Interprets financial information within procurement agreements\nNavigate the world of work: Understands legal and organisational obligations that underpin agreements and contracts with suppliers\nInteract with others: Liaises with suppliers and relevant personnel to gain agreement on required performance levels\nSelects the appropriate form, channel and mode of communication for a specific purpose relevant to own role\nGet the work done: Plans and implements tasks required to manage agreements, including negotiating and coordinating input from others\nUses analytical processes to decide on a course of action, establishing criteria for deciding between options, and seeking input and advice from others\nUses systematic, analytical processes to identify and solve performance problems\nCode and title \ncurrent version: Code and title\nprevious version\nBSBPRC502 Manage supplier relationships\nRelease 1: BSBPUR502 Manage supplier relationships\nRelease 1\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 3.0.",
      "learning_outcomes": [
        "successfully manage relationships with suppliers over the life of specific procurement agreements in accordance with organisational policies and procedures, including:",
        "using effective communication to resolve disputes with suppliers amending and developing documentation to finalise an agreement with a supplier",
        "evaluate supplier performance and formulate recommendations about future use of supplier.",
        "Note: If a specific volume or frequency is not stated, then evidence must be provided at least once."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate the following knowledge to effectively complete the tasks outlined in the elements and performance criteria of this unit, and to manage tasks and reasonably foreseeable contingencies in the context of the work role:\nkey features of procurement supplier relationship management\nmethodologies to monitor, review and evaluate supplier performance\nkey techniques to successfully manage and resolve supplier disagreements\nkey features to outline organisation’s policies and procedures related to:\nconduct and ethics\nprocurement\ntendering and contracting.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBPRC505",
      "name": "Manage ethical procurement strategy",
      "description": "Application:\nThis unit describes the skills and knowledge required to employ ethical procurement processes and policies to identify suppliers’ contribution to improve the ethics of that specific supply chain, such as waste, water, emissions, materials, service and innovation.\nIt applies to individuals who manage the ethical procurement of goods and/ or services from a variety of sources. While an individual may work closely with other staff members in the organisation, they have individual responsibility and autonomy to identify ethical procurement risks, develop management programmes and evaluate suppliers against organisation ethical procurement policies and procedures.\nNo licensing, legislative, regulatory or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Identify vulnerability and risk associated with procurement: 1.1 Research and identify ethical procurement policies and procedures and their alignment to organisational objectives\n1.2 Determine specifications of goods and/ or services to be procured\n1.3 Assess ethical vulnerabilities and risks associated with procurement of goods and/ or services in accordance with organisational policies and procedures\n1.4 Document and report ethical procurement vulnerabilities and risks to stakeholders\n2. Develop ethical procurement strategy: 2.1 Develop organisational ethical procurement strategy in accordance with organisational policies and procedures\n2.2 Assign responsibility to relevant personnel for the monitoring of ethical procurement strategy\n2.3 Seek endorsement of ethical procurement strategy from organisational management\n3. Evaluate suppliers and offers: 3.1 Engage suppliers in ethical procurement objectives\n3.2 Analyse supplier ethical procurement against key performance indicators \n3.3 Evaluate and select suppliers with negative ethical procurement impacts\n3.4 Confirm and agree chosen supplier with organisational management\n4. Create contract and performance indicators: 4.1 Establish contract documentation in accordance with ethical procurement strategies and organisational policies and procedures\n4.2 Communicate the contents of the contract, emphasising ethical procurement requirements \n4.3 Determine arrangements for delivery of goods and/ or services to be satisfactory to both organisation and supplier\n4.4 Implement relevant ethical procurement key performance indicators to measure supplier against organisational objectives\n4.5 Establish ongoing dialogue with supplier to facilitate transparency and accountability\n5. Evaluate and update ethical procurement strategy: 5.1 Evaluate supplier against ethical procurement performance indicators\n5.2 Undertake gap analysis between desired and actual performance, and establish new goals\n5.3 Embed recognition and reward for good supplier practice\n5.4 Consult with stakeholders to confirm revised ethical procurement strategy\nSkill: Description\nReading: Analyses, matches and interprets information, paying attention to detail to identify errors\nWriting: Records information accurately using correct spelling, grammar and terminology\nOral Communication: Uses questioning and active listening to convey and clarify information and instructions\nNumeracy: Performs mathematical analysis to verify financial information\nNavigate the world of work: Follows legislative requirements, and organisational protocols, policy and procedures relevant to own role\nInteract with others: Uses correct communication practices and protocols to obtain strategy approval from stakeholders\nGet the work done: Plans, organises and implements tasks according to organisational requirements\nResponds to problems by implementing standard or logical solutions\nCode and title \ncurrent version: Code and title\nprevious version\nBSBPRC505 Manage ethical procurement strategy\nRelease 1: Not applicable\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 3.0.",
      "learning_outcomes": [
        "develop ethical procurement strategies for an organisation, including:",
        "researching and documenting ethical procurement vulnerabilities and risks",
        "evaluating suppliers through ethical procurement performance indicators",
        "liaise with stakeholders and suppliers to effectively facilitate ethical procurement",
        "evaluate and implement improvements to procurement strategies in an organisation.",
        "Note: If a specific volume or frequency is not stated, then evidence must be provided at least once."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate the following knowledge to effectively complete the tasks outlined in the elements and performance criteria of this unit, and to manage tasks and reasonably foreseeable contingencies in the context of the work role:\nkey provisions of relevant legislation that affect procurement and contracting\nkey indicators to evaluate ethical procurement supplier performance\nkey ethical procurement vulnerabilities and risks\norganisational policies and procedures related to:\nethical business terms and conditions for procurement\ncontracting and tendering\nsupply chain management\nprocurement.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBSTR503",
      "name": "Develop organisational policy",
      "description": "Application:\nThis unit describes the skills and knowledge required to develop and review policy in an organisation. It covers anticipating and confirming the need for policy development or review; planning the policy development process; gathering and analysing information; determining policy direction; and drafting, releasing and promoting policy.\nThe unit applies to managers who draft and review policy that is formulated to facilitate the implementation of decisions made by senior executives, business owners and boards of management or similar.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Review existing policy: 1.1 Identify existing policies in the organisation\n1.2 Analyse existing policies according to organisational procedures \n1.3 Evaluate improvement needs and opportunities\n1.4 Consult with relevant stakeholders and confirm need for new policy development\n2. Establish need for policy development: 2.1 Identify internal and external factors likely to cause changes to organisation policy\n2.2 Consult with relevant stakeholders and document impacts of factors identified\n2.3 Analyse need for new policy against internal and external environment and existing policies\n2.4 Identify and recommend to relevant stakeholders priority areas for policy development according to organisational procedures \n2.5 Identify and analyse associated issues and risks likely to impact policy development\n2.6 Implement risk management processes\n3. Prepare for and develop policy: 3.1 Identify type of information required to develop policy\n3.2 Outline policy requirements according to organisational procedures\n3.3 Develop an analytical framework for the development of policy\n3.4 Source, analyse and apply relevant information to support policy development according to organisational policies and procedures\n3.5 Develop, consult with and recommend to relevant stakeholders a range of policy options and assessment criteria\n3.6 Obtain approvals from stakeholders according to the policy development plan and organisational policies and procedures\n3.7 Draft policy according to consultations, feedback and organisational policies and procedures\n3.8 Facilitate agreement to policy via organisational channels and relevant stakeholders\n4. Release and review policy development process and policy: 4.1 Communicate with relevant stakeholders responsible for implementing new policy \n4.2 Facilitate discussion and manage dissenting stakeholders \n4.3 Release and promote the policy according to organisational requirements\n4.4 Seek feedback and respond to relevant stakeholders for future improvements for policy development\nSKILL: DESCRIPTION\nReading: Analyses and interprets textual information from a range of sources to inform policy review and development\nWriting: Develops texts dealing with complex ideas and concepts using specialised and detailed language to convey explicit information according to compliance and organisational requirements\nPrepares written reports and workplace documentation that communicates strategy and intent clearly and effectively and elicits feedback\nOral communication: Uses specialised vocabulary to discuss and confirm policy development requirements adjusting words and features to suit audience and context\nInitiative and enterprise: Adapts communication style to build positive working relationships and to show acknowledgement of the opinions of others\nLearning: Recognises, understands and applies organisational policies, procedures and protocols\nSelf-management: Takes responsibility for planning and implementing tasks required to achieve organisational objectives\nSeeks advice, feedback and support, as required to assist in the development, planning, review and implementation phases\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "develop, revise and promote at least one policy.",
        "In the course of the above, the candidate must:",
        "plan, develop and implement policy using iterative and consultative processes with input from representative stakeholders",
        "analyse internal and external factors",
        "consult with stakeholders to identify needs for policy review and policy development",
        "develop analytical framework",
        "ensure style and format requirements for organisational policy documentation is followed",
        "promote policy."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\npolicy development processes and practices\nrisk management processes\nexisting policies and improvements needs and opportunities\nstakeholder and issues management strategies\nquality assurance, monitoring and evaluation mechanisms\noperation of policy cycles\nlegislative and regulatory context required to develop organisation policies\norganisational channels to promote policy\nkey components of policy, including:\ndifferent policy options\nimplementation plan that details:\nresponsibilities for implementation\nstrategies for transition, change management, initial and ongoing training and policy maintenance mechanisms for monitoring compliance with the policy, quality assurance and evaluation of the policy.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBSTR603",
      "name": "Develop business continuity plans",
      "description": "Application:\nThis unit describes the skills and knowledge required to work within the business continuity framework to develop and implement business continuity plans for an organisation to manage risk and ensure business resilience when faced with a disruptive event. This unit addresses the knowledge and processes necessary to develop and maintain business continuity requirements.\nThe focus is on risk and vulnerability assessment, business impact assessments, and business continuity and communication plans.\nThe unit applies to individuals working in positions of authority who are approved to implement change across the division, business area, program area or project area.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Identify scope, key business areas and critical functions: 1.1 Identify organisational expectation, objectives, and policies and procedures\n1.2 Identify resources required and relevant stakeholders \n1.3 Identify and analyse sources of disruption to the organisation’s priorities, operations and environment\n1.4 Identify organisation’s emergency response, continuity and recovery strategies\n1.5 Determine organisation’s critical business functions, its dependencies and interdependencies, and risk and disruption scenarios\n2. Establish documents required to create business continuity plan: 2.1 Develop business continuity management framework\n2.2 Analyse and evaluate risks associated with business continuity management framework\n2.3 Report associated risks to and seek feedback from relevant stakeholders on business continuity management framework\n2.4 Conduct business impact assessment of implementation of business continuity framework \n2.5 Analyse and validate outcomes of business impact assessment and feedback \n2.6 Report outcomes to and seek feedback from relevant stakeholders on business impact assessment\n2.7 Develop and implement risk treatments strategies and plan\n2.8 Seek feedback from relevant stakeholders on and review risk treatments strategies and plan\n3. Create business continuity plan: 3.1 Determine if disaster recovery plan exists\n3.2 Consult and develop with relevant stakeholders disaster recovery plan, where required\n3.3 Consult and develop with relevant stakeholders business continuity plan according to regulations, standards, industry practice and geographical dispersion, where required\n3.4 Seek, document and analyse feedback received and finalise business continuity plan\n3.5 Provide relevant staff with required information on business continuity plan \n3.6 Assign relevant staff actions to implement business continuity plan \n3.7 Establish communication plan to report and escalate processes\n3.8 Manage and record staff learning and development, management, and implementation of business continuity plan on organisation’s knowledge management system\n4. Evaluate business continuity plan: 4.1 Report outcomes and seek feedback from relevant stakeholders on business continuity plan\n4.2 Report to relevant stakeholders outcomes of staff learning and development, and business continuity framework exercises \n4.3 Assess gaps for improvement\n4.4 Make changes to business continuity plan according to feedback received and identified gaps\nSKILL: DESCRIPTION\nReading: Interprets organisation’s reports, policies and procedures to develop business continuity management plan\nWriting: Develops detailed workplace documentation clarifying complex ideas using relevant language and structure according to context and audience\nOral communication: Uses clear language, required tone and syntax to address key stakeholders and disseminate information\nInforms staff about processes and outcomes of business continuity management plans and outcomes of staff learning and development and other reviews\nNumeracy: Analyses and interprets numerical information to assist in undertaking detailed business impact assessment activities across the spectrum of the organisation’s stakeholders\nSelf-management: Takes responsibility and ownership of own work and is autonomous\nRecognises and manages factors that may affect achievement of outcomes\nRecognises the critical importance of clarifying, focusing and aligning goals and expectations and may use the process to build ownership of and broad commitment to achieving outcomes\nUses formal decision-making processes as scaffolding for thinking, seeking input, advice, feedback and specialist advice, as required\nInitiative and enterprise: Tailors every communication to achieve its purpose, demonstrating a sophisticated understanding of the needs, interests, issues and priorities of each audience\nInvests time and energy in building rapport with others as an integral part of all work-based interactions\nMonitors adherence to wide-ranging organisational policies and procedures \nUses active listening, observational and questioning techniques to identify different perspectives and confirm, clarify and revise understanding\nProblem solving: Recognises and addresses complex problems involving multiple variables\nDraws on a broad understanding of context and uses a combination of analysis and intuition to decide whether an idea is worth developing and implementing\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "develop and implement a business continuity plan for an organisation or work area on at least one occasion, including:",
        "developing business continuity management framework",
        "developing business impact assessment",
        "developing risk treatments strategies and plan",
        "developing new or updating existing disaster recovery plan",
        "coordinating organisation’s emergency response, continuity and recovery strategies",
        "managing and recording staff learning and develop on organisation’s knowledge management system.",
        "In the course of the above, the candidate must:",
        "communicate effectively with stakeholders to promote an understanding of business continuity frameworks."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\npolicies and procedures impacting business continuity, including business continuity strategies\noverall operations of the organisation, including:\nexisting data and information systems\npaper and digital recordkeeping systems\norganisation’s resources\ncritical business functions, including:\ndependencies and interdependencies\nrisk and disruption scenarios\nmethods for developing business continuity management framework\nmethods for conducting business impact assessment\nkey elements of business continuity plan\nregulations, standards, industry practice and geographical dispersion\nkey elements of risk treatments strategies and plan\nkey elements of disaster recovery plan\norganisation’s emergency response, continuity and recovery strategies\nkey features of organisation’s knowledge management system\npast and current internal, external and industry disruptions.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBSUS511",
      "name": "Develop workplace policies and procedures for sustainability",
      "description": "Application:\nThis unit describes the skills and knowledge required to develop and implement workplace sustainability policies and to modify the policy to suit changed circumstances.\nThe unit applies to individuals with managerial responsibilities who undertake work developing approaches to create, monitor and improve strategies and policies within workplaces. These individuals also engage with a range of relevant stakeholders and specialists.\n‘Sustainability’ in this unit refers to a broad approach that focuses on the minimisation of an organisation’s social, economic and environmental impact, as well as proactive value creation in these areas.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Prepare workplace sustainability policies: 1.1 Establish scope and objectives of workplace sustainability policies \n1.2 Gather information for development of sustainability policies\n1.3 Analyse information and consultation insights \n1.4 Develop and document sustainability policies according to organisational processes\n1.5 Incorporate implementation and continuous improvement processes into sustainability policies\n2. Implement workplace sustainability policies: 2.1 Present workplace sustainability policies and implementation processes to key stakeholders\n2.2 Identify and source resources required to implement sustainability policies \n2.3 Support implementation of workplace sustainability policies \n2.4 Track continuous improvements in sustainability approaches using recording systems\n3. Review implementation of workplace sustainability policies: 3.1 Document outcomes and provide feedback to key personnel and stakeholders\n3.2 Identify trends requiring remedial action to promote continuous improvement of performance\n3.3 Modify sustainability policies to incorporate improvements\nSkill: Description\nNumeracy: Interprets and uses mathematical equations to calculate numerical information relating to time durations and costs\nOral communication: Presents information and seeks advice using language appropriate to audience\nParticipates in discussions using listening and questioning to elicit the views of others and to clarify or confirm understanding\nReading: Identifies, analyses and evaluates complex textual information to determine legislative and regulatory requirements, trends and outcomes\nWriting: Researches, plans and prepares documentation using format and language appropriate to context, organisational requirements and audience\nInitiative and enterprise: Develops, monitors and modifies organisational policies and procedures according to legislative requirements and organisation goals\nTeamwork: Selects and uses appropriate conventions and protocols when communicating with internal and external stakeholders to seek or share information\nPlays a lead role in consulting and negotiating positive outcomes with a range of stakeholders\nPlanning and organising: Plans, organises and implements work activities of self and others that ensure compliance with organisational policies and procedures, and legislative requirements \nSequences and schedules complex activities, monitors implementation, and manages relevant communication\nUses systematic, analytical processes in relatively complex, situations, setting goals, gathering relevant information, and identifying and evaluating options against agreed criteria \nEvaluates outcomes of decisions to identify opportunities for improvement\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "develop and implement workplace policies and procedures for sustainability on at least one occasion, including:",
        "implementing sustainability policy and procedures into wider organisational policies and procedures",
        "consulting and communicating with relevant stakeholders to generate engagement with sustainability policy development, implementation and continuous improvement."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\nAustralian and international standards relating to corporate sustainability\nenvironmental and sustainability legislation, regulations and codes of practice applicable to organisation\ninternal and external sources of information and their use in planning and developing organisational sustainability policies and procedures\nelements required for the development of organisational sustainability policies and processes including:\nagreed outcomes of the policy and procedures\npolicy timeframes and costs\nperformance indicators\nactivities to be undertaken\nassigned responsibilities\nrecord keeping, review and improvement processes\ncommon sustainability issues with organisational systems and procedures\ntypical barriers to implementing policies and procedures in an organisation and possible strategies to address them.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBSUS601",
      "name": "Lead corporate social responsibility",
      "description": "Application:\nThis unit describes the skills and knowledge required to consult with stakeholders to develop, implement and evaluate corporate social responsibility policy in an organisation.\nThe unit applies to individuals working in senior roles in diverse contexts who have responsibility for ensuring an organisation is positioned to ensure its long-term viability and success.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Identify context for corporate social responsibility: 1.1 Qualify and quantify the drivers for corporate social responsibility\n1.2 Identify current benefits of, and barriers to, corporate social responsibility for organisation \n1.3 Analyse legislation, regulation, standards and organisational policy affecting corporate social responsibility\n1.4 Identify future opportunities for socially responsible practices\n2. Establish corporate social responsibility policy: 2.1 Identify key stakeholders for organisational corporate social responsibility \n2.2 Engage with stakeholders to develop corporate social responsibility objectives and policy\n2.3 Develop change management provisions for corporate social responsibility strategy\n2.4 Draft and incorporate social responsibility strategy into required organisational systems, procedures and processes\n2.5 Prepare and distribute documentation regarding corporate social responsibility strategy\n3. Monitor and evaluate corporate social responsibility: 3.1 Conduct review of corporate social responsibility integration with relevant people\n3.2 Evaluate corporate social responsibility against organisational sustainability objectives\n3.3 Recommend improvements to corporate social responsibility policy and practices\nSkill: Description\nNumeracy: Interprets, analyses and presents numeric and financial information\nOral communication: Uses specialised vocabulary and features appropriate to context to discuss and confirm requirements\nReading: Sources, analyses and interprets textual information in the context of complex organisational strategy and compliance requirements\nWriting: Prepares reports and workplace documentation that communicate strategy and related information to suit audience and context\nTeamwork: Uses inclusive and collaborative techniques to cooperate and consult with others to identify options to support policy objectives\nPlanning and organising: Develops plans to implement organisation-wide strategies\nMonitors processes, evaluates performance against agreed benchmarks and recommends improvements to ensure compliance with organisation, statutory and legal requirements\nProblem solving: Recognises, understands and applies legislation, regulation and organisational policies and procedures relevant to strategy\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "establish, monitor and evaluate corporate social responsibility for two areas or opportunities.",
        "In the course of the above, the candidate must:",
        "consult and communicate with relevant stakeholders to develop CSR objectives and policy that align to organisational goals",
        "negotiate with stakeholders to integrate corporate social responsibility practices into policies and procedures."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\nkey provisions of legislation, covenants, standards and codes of practice relating to Australian and international standards relating to CSR\ninternal and external sources of information relevant to the CSR framework including:\nlegislation, regulation, standard and codes of practice\norganisational objectives, culture and current policies and practices\nelements of a CSR strategy including:\norganisational goals, drivers and expected benefits\nopportunities and barriers to CSR implementation and operation\nrelevant stakeholders\nemerging approaches and best practice in CSR relevant to organisational context and industry\nchange management techniques\nprocedures for maximising engagement in CSR, including strategies and techniques for:\nconsultation\ngenerating ideas and options\ncommunicating information\naddressing barriers and resolving problems.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBTWK401",
      "name": "Build and maintain business relationships",
      "description": "Application:\nThis unit describes the skills and knowledge required to establish, develop and maintain effective work relationships and networks through relationship building and negotiation skills required by workers. These workers may be within an organisation as well as freelance or contract workers.\nThe unit applies to individuals with a broad knowledge of networking and negotiation who contribute to creating solutions to unpredictable problems. They may have responsibility for and provide guidance to others.\nNo licensing, legislative, regulatory or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Establish business relationships: 1.1 Identify business development and networking objectives of the organisation and own role \n1.2 Determine networking opportunities according to identified objectives and organisational policies and procedures\n1.3 Confirm communication channels for information exchange with business contacts  \n1.4 Engage with business contacts using written and verbal communication to promote business opportunities\n2. Maintain business relationships: 2.1 Use communication techniques to establish rapport with business contacts \n2.2 Identify barriers to business development opportunities \n2.3 Use problem-solving techniques to negotiate solutions to identified situations \n2.4 Seek specialist advice in the development of contacts, as required\n3. Build and improve business relationships: 3.1 Develop strategies to represent and promote organisational interests to contacts\n3.2 Participate in formal and informal networks that promote the organisation \n3.3 Communicate issues regarding relationships in writing and verbally to organisational personnel \n3.4 Seek and respond to feedback from management on the quality of relationships with business contacts\nSKILL: DESCRIPTION\nLearning: Seeks opportunities to develop and extend expertise and identify areas for professional improvement\nReading: Sources and analyses information to establish networks that consistently promotes business opportunities\nWriting: Uses appropriate vocabulary, layout and grammatical structure to convey ideas and information\nOral Communication: Uses persuasive language and appropriate non-verbal features to achieve mutually acceptable outcomes\nUses active listening and questioning techniques to confirm understanding\nInitiative and enterprise: Identifies and adheres to organisational policies and procedures\nTeamwork: Looks for ways to establish connections and build genuine understanding with a diverse range of people\nCultivates relationships with people with the knowledge, skills and influence to get things done or provide support\nPlanning and organising: Takes responsibility for planning, sequencing and implementing tasks required to build and maintain networks\nUses analytical processes to identify problems, gather relevant information, evaluate options and determine solutions\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "communicate with others to build and maintain at least two different business relationships.",
        "In the course of the above, the candidate must:",
        "promote professional business relationship using written and verbal communication techniques",
        "identify methods to improve business relationships",
        "participate in formal and informal networking opportunities that promote the business."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\nstrategies for establishing and maintaining business relationships\nmethods of engaging with business contacts including through participation in professional networks and associations\nrelevant networks, organisations, agencies, associations or individuals\nprinciples and techniques needed to negotiate positive outcomes\norganisational policies, plans and procedures relevant to business relationships\nmethods for obtaining feedback on business relationships.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBTWK503",
      "name": "Manage meetings",
      "description": "Application:\nThis unit describes the skills and knowledge required to manage a range of meetings including overseeing the meeting preparation processes, chairing meetings, organising the minutes and reporting meeting outcomes.\nThe unit applies to individuals employed in a range of work environments who are required to organise and manage meetings within their workplace. These individuals may work as senior administrative staff or may be individuals with responsibility for conducting and chairing meetings in the workplace.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Prepare for meetings: 1.1 Develop agenda according to meeting purpose \n1.2 Establish and verify meeting requirements with relevant individuals \n1.3 Contact and confirm meeting with participants according to organisational procedures\n1.4 Provide meeting papers to participants according to task requirements\n2. Conduct meetings: 2.1 Chair meetings according to organisational requirements, agreed conventions for type of meeting and legal and ethical requirements \n2.2 Promote participation, discussion, problem solving and resolution of issues \n2.3 Brief minute-taker on method for recording meeting notes\n3. Follow up meetings: 3.1 Review meeting minutes and edit, as required \n3.2 Distribute and store minutes and other follow-up documentation within designated timelines, and according to organisational requirements\n3.3 Report outcomes of meetings, as required, within designated timelines\nSKILL: DESCRIPTION\nReading: Identifies and interprets information from complex texts including organisational policies and procedures\nWriting: Addresses the context, purpose and audience when generating a range of texts\nPrepares notes using appropriate structure, and accurate spelling, grammar and punctuation \nEdits and corrects own work to ensure accuracy\nOral Communication: Participates in verbal exchanges using appropriate style, tone and vocabulary for audience, context and purpose\nListens for specific information during meetings\nAsks questions and listens to responses to clarify understanding\nNumeracy: Identifies and interprets numerical information related to timeframes\nEnterprise and initiative: Identifies and responds to both explicit and implicit organisational procedures and protocols and legislative and regulatory requirements\nPlanning and organising: Applies formal processes when planning complex tasks, producing plans with logically sequenced steps, reflecting an awareness of time constraints \nRecognises and takes responsibility for addressing predictable problems in familiar work contexts\nRelease: Comments\nRelease 1: This version first released with BSB Business Services Training Package Version 7.0.",
      "learning_outcomes": [
        "manage a meeting on at least two occasions.",
        "In the course of the above, the candidate must:",
        "apply conventions and procedures for meetings including:",
        "developing and distributing agendas and papers",
        "identifying and inviting meeting participants",
        "organising and confirming meeting arrangements",
        "conducting meeting",
        "completing meeting-follow up actions",
        "follow relevant organisational policies and procedures."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements, performance criteria and foundation skills of this unit, including knowledge of:\nmeeting terminology, structures and arrangements\nresponsibilities of the chairperson and key features of group dynamics in relation to managing meetings\nkey features of options for meetings including face-to-face and virtual meetings\nmethods for recording meeting notes including relevant organisational requirements and conventions for type of meeting\norganisational procedures and policies regarding meetings, chairing and minutes including identifying organisational formats for minutes and agendas.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "BSBXCM501",
      "name": "Lead communication in the workplace",
      "description": "Application:\nThis unit describes the skills and knowledge required to lead communication in the workplace within any industry.\nThis unit has a specific focus on the communication skills required for team leaders with responsibility for other workers.\nNo licensing, legislative or certification requirements apply to this unit at the time of publication.",
      "learning_outcomes": [
        "collate research on internal and external communication needs",
        "develop and implement communication protocols in accordance with organisational requirements",
        "present information in a persuasive and professional manner",
        "apply negotiation techniques to reach desired outcomes",
        "address communication challenges for continuous improvement."
      ],
      "assessment_requirements": "Assessment Conditions: The candidate must be able to demonstrate knowledge to complete the tasks outlined in the elements and performance criteria of this unit. This includes knowledge of:\nlegislative requirements relevant to workplace communication\norganisational requirements relevant to workplace communication (including digital form):\nworkplace policies\ncodes of conduct\norganisational reputation and culture\ntechniques to resolve communication challenges\nmethods to mentor and coach others\nkey principles of cross-cultural communication and communication with individuals with special needs or disabilities\ncommunication protocols relevant to organisational information needs:\ninternal and external communication guides\nrisk based/emergency communication guides\nstyle/formatting of communication guides\nprocesses for allocation of responsibilities for standard communication\ncommunication challenges relevant to performance evidence:\nconflicts with clients or team members\npotential risks or safety hazards\nunethical or inappropriate communication\nappropriately framing organisational messaging\nkey relevant features of:\ndifferent communication styles\ndifferent communication methods\nrelevant cross cultural communication techniques\nnegotiation and conflict resolution techniques.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "SIRXMGT005",
      "name": "Lead the development of business opportunities",
      "description": "Application:\nNot applicable.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1.\tIdentify new business opportunities.: 1.1.Review existing operations to identify and analyse new business opportunities.\n1.2.Research business trends relevant to the organisation to identify new business opportunities. \n1.3.Identify and evaluate opportunities and threats from internal and external environments.\n1.4.Consult with stakeholders and customers to seek input into business opportunities.\n1.5.Determine organisational capacity to respond to identified opportunities and select opportunities to peruse.\n2.\tDevelop a business development plan.: 2.1.Prepare feasibility studies and reports that assess viability, profitability and sustainability of development opportunities.\n2.2.Analyse risks associated with initiatives and ensure compliance with legislative and regulatory requirements.\n2.3.Develop and document a business development plan outlining priorities, responsibilities, performance indicators, timelines and budgets.\n2.4.Communicate plans to relevant personnel and seek required approval.\n2.5.Test business development initiatives for acceptance in the market place.\n2.6.Prioritise potential business development opportunities for action.\n3.\tImplement business development plan.: 3.1.Communicate the business develop plan to relevant stakeholders and personnel.\n3.2.Allocate resources to support the delivery of business development opportunities.\n3.3.Oversee the roll-out of marketing and communication processes to target markets launching new business initiatives.\n4.\tEvaluate impact of business development plans.: 4.1.Monitor and evaluate new business initiatives against desired outcomes and performance indicators.\n4.2.Review business development plans in line with changing organisational and business requirements.\nFoundation skills essential to performance in this unit, but not explicit in the performance criteria are listed here, along with a brief context statement.: Foundation skills essential to performance in this unit, but not explicit in the performance criteria are listed here, along with a brief context statement.\nSKILLS: DESCRIPTION\nWriting skills to:: prepare complex business documents.\nNumeracy skills to:: analyse financial viability of new opportunities.\nProblem solving skills to:: exercise judgement and decision making when selecting opportunities for business development.\nInitiative and enterprise skills to:: apply lateral and creative thinking to the development of new opportunities.",
      "learning_outcomes": [
        "Evidence of the ability to complete tasks outlined in elements and performance criteria of this unit in the context of the job role, and:",
        "identify business opportunities and develop a business development plan for the implementation of one identified opportunity by:",
        "researching and analysing internal and external business environments to determine opportunities for business development",
        "determining feasibility of and risks associated with business development opportunities",
        "developing business plan that details:",
        "priorities",
        "responsibilities",
        "performance indicators",
        "timelines",
        "budgets",
        "evaluating the above plan against performance indicators and report on impact and effectiveness."
      ],
      "assessment_requirements": "Performance Evidence: Not applicable.\n\nAssessment Conditions: Demonstrated knowledge required to complete the tasks outlined in elements and performance criteria of this unit:\ntechniques for:\nidentifying and analysing business opportunities\ndetermining feasibility of business development opportunities\nevaluating business development plans\nformats of business development plans\ninternal and external environments and their role in determining business opportunities\nrisks associated with business development opportunities and strategies to minimise risks\nbudgeting and financial planning procedures\nbusiness development opportunities and trends in the relevant industry.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "SIRXMKT006",
      "name": "Develop a social media strategy",
      "description": "Application:\nNot applicable.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1. Determine social media requirements.: 1.1. Review organisational strategic objectives and determine objectives and priorities for social media use. \n1.2.  Source and analyse information about the target market, its social media use, behaviours and preferred platforms.\n1.3. Identify and analyse emerging trends in social media platform use. \n1.4. Review and compare social media platforms and select those that meet organisational and target market needs. \n1.5. Identify opportunities for social media integration with existing systems and procedures. \n1.6. Identify opportunities to maximise business exposure through social media activity. \n1.7. Determine opportunities for building brand awareness and an online community through social media use.\n2. Develop social media policies and procedures.: 2.1. Establish scope of social media policies and procedures based on planned social media activity.\n2.2. Establish guidelines for social media engagement and content use.  \n2.3. Develop issue and crisis management guidelines and appropriate responses.\n2.4. Integrate legal and ethical considerations into social media policies and procedures.\n2.5. Ensure policies and procedures are customer-focused and align with organisational marketing plan and strategy.\n3. Develop social media strategy.: 3.1. Determine strategies for social media content development, customer engagement and customer service. \n3.2. Develop and document a social media action plan detailing key responsibilities, resourcing requirements and timeframes. \n3.3. Prepare a social media calendar documenting planned social media activity in line with marketing strategy and promotional activities.\n3.4. Establish key performance indicators and evaluation criteria for measuring success of social media activity.\n3.5. Establish methods for tracking and analysing social media engagement, activity and reach. \n3.6. Ensure social media strategy aligns with organisational objectives and customer service standards.\n4. Monitor social media use.: 4.1. Communicate social media strategy, action plan, calendar and policies and procedures with relevant personnel. \n4.2. Monitor social media issues and crisis management and take required action to ensure impacts are minimised and occurrence of future issues or crisis are minimised. \n4.3. Ensure tracking of social media engagement, activity and reach. \n4.4. Monitor posting of social media content and ensure alignment with social media strategy, policies and procedures.\n5. Review social media performance.: 5.1. Analyse captured data to determine social media engagement, activity and reach. \n5.2. Evaluate social media activity against strategy and use performance indicators to evaluate success of social media use. \n5.3. Identify opportunities for future improvements in social media use and modify strategy and plans accordingly.\nFOUNDATION SKILLS: FOUNDATION SKILLS\nFoundation skills essential to performance in this unit, but not explicit in the performance criteria, are listed here, along with a brief context statement.: Foundation skills essential to performance in this unit, but not explicit in the performance criteria, are listed here, along with a brief context statement.\nSKILLS: DESCRIPTION\nReading skills to:: interpret social media technical and key terminology\ninterpret complex and potentially unfamiliar information sources related to social media use\nNumeracy skills to:: interpret and analyse social media activity reports.\nTechnology skills to:: use technologies and devices that support social media platforms.",
      "learning_outcomes": [
        "Evidence of the ability to complete tasks outlined in elements and performance criteria of this unit in the context of the job role, and:",
        "research and compare at least three different social media platforms for organisational use and select platforms that best meet organisational social media requirements",
        "for each platform identify:",
        "key features",
        "benefits",
        "limitations",
        "functionality",
        "target audience and key users",
        "terms of use",
        "develop organisational policies and procedures for social media use detailing:",
        "appropriate use of social media",
        "appropriate content use and posting",
        "complaints handling and crisis management",
        "meeting legal and ethical responsibilities",
        "privacy and security",
        "develop a social media strategy for execution over a three-month period that details:",
        "calendar of activities",
        "resourcing requirements",
        "content strategy",
        "engagement strategy",
        "activity and engagement tracking",
        "key performance indicators and evaluation criteria",
        "monitor and review social media data to review social media performance over a one month-period and make recommendations for future improvements."
      ],
      "assessment_requirements": "Performance Evidence: Not applicable.\n\nAssessment Conditions: Demonstrated knowledge required to complete the tasks outlined in elements and performance criteria of this unit:\nkey legal and ethical considerations as relevant to social media use:\nAustralian Consumer Law\ncopyright\nprivacy\ncodes of practice\ndata and personal security\ntrends in social media use and role in:\nconsumer engagement and feedback\ngenerating sales\npromotions and marketing\nbranding\nsocial media platforms:\nkey features\nbenefits\nlimitations\nfunctionality\ntarget audience and key users\nterms of use\nkey contents of organisational social media policies and procedures:\nappropriate use of social media\nappropriate content use and posting\ncomplaints handling and crisis management\nmeeting legal and ethical responsibilities\nprivacy and security\ntechniques for achieving the following through social media use:\ncustomer engagement\nbrand awareness\nbrand advocacy\nincreased sales\nimproved reach\nrole and benefits of user-generated content\nrole and key inclusions of a social media strategy:\ncalendar of activities\nresourcing requirements\ncontent strategy\nengagement strategy\nactivity and engagement tracking\nkey performance indicators and evaluation criteria\naction plan\ntools and methods for tracking social media activity\ntypes of social media issues and crisis:\npotential impact\nmanagement strategies.",
      "nominal_hours": null,
      "prerequisites": []
    },
    {
      "code": "SIRXSLS004",
      "name": "Drive sales results",
      "description": "Application:\nNot applicable.\n\n\nElements and Performance Criteria:\nElements describe the essential outcomes.: Performance criteria describe the performance needed to demonstrate achievement of the element.\n1.\tReview current operations.: 1.1.Analyse external retail market place to determine factors impacting sales.\n1.2.Obtain and review organisational sales strategy. \n1.3.Review current sales targets and performance and contributing factors that impact sales.\n1.4.Obtain feedback from existing customers on current product and service offerings.\n1.5.Analyse information to inform plans to drive sales.\n2.\tDevelop a plan to drive sales.: 2.1.Identify potential customer traffic generators to attract new customers. \n2.2.Determine how to retain and develop repeat business from existing customers.\n2.3.Consult relevant stakeholders for input into sales plan. \n2.4.Develop a plan to grow sales from new and existing customers.\n3.\tImplement and monitor sales plan.: 3.1.Communicate plan to relevant personnel delegating key responsibilities.\n3.2.Schedule activities and resources to drive sales.\n3.3.Undertake planned sales activities and support sales teams in creating a selling environment. \n3.4.Monitor plan against targets and adjust as required.\nFoundation skills essential to performance in this unit, but not explicit in the performance criteria are listed here, along with a brief context statement.: Foundation skills essential to performance in this unit, but not explicit in the performance criteria are listed here, along with a brief context statement.\nSKILLS: DESCRIPTION\nReading skills to:: gather, interpret and analyse textual information from sources to identify information relevant to retail sales management.\nWriting skills to:: prepare effective written communications to multiple stakeholders in line with organisational procedures.\nOral communication skills to:: consult multiple stakeholders using questioning and listening to elicit opinions, and to confirm and clarify comprehension.\nNumeracy skills to:: assess sales results and use numerical data to inform plans.\nTechnology skills to:: use digital technologies and systems to access information, document plans and communicate with others.",
      "learning_outcomes": [
        "Evidence of the ability to complete tasks outlined in elements and performance criteria of this unit in the context of the job role, and:",
        "develop and implement a plan to retail drive sales that includes:",
        "comprehensive overview of current operations:",
        "sales process and selling environment",
        "average spend and conversion rates",
        "stock levels in relation to customer demand",
        "customer feedback",
        "trends in consumer behaviour",
        "competitor activity",
        "economic activity",
        "organisational sales targets",
        "traffic generators for new customers",
        "tactics to retain existing customers",
        "tactics to increase average spend and conversion rates",
        "monitor and review sales results against a sales plan for one sales period and identify areas for improved sales performance."
      ],
      "assessment_requirements": "Performance Evidence: Not applicable.\n\nAssessment Conditions: Demonstrated knowledge required to complete the tasks outlined in elements and performance criteria of this unit:\nkey elements and features of a sales plan\ninternal factors impacting on sales\nexternal factors impacting sales in the retail environment:\ntrends in consumer behaviour\ncompetitor activity\neconomic activity\nrole of customer feedback in growing sales\ncustomer traffic generators\ntechniques for growing sales within the retail environment for:\nnew customers\nexisting customers\nincreasing average spend and conversion rates\nmarketing activities and their role in sales:\npromotions\nsocial media campaigns\nadvertising campaigns.",
      "nominal_hours": null,
      "prerequisites": []
    }
  ]
}